Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/api_reference.po
Languages: ru

source: resource is not a directory
ru: указанный ресурс не является папкой

source: Create a new directory at `path`. If its parent directory doesn't exist it will also be created recursively.
ru: Создаёт новую папку. Если родительская папка не сущсетвует, то онабудет также создана рекурсивно.

source: path to the directory to be created
ru: путь к папке, подлежащей созданию

source: cannot create directory due to lack of storage space
ru: невозможно создать папку из-за нехватки места на Диске

source: Create a new directory.
ru: Создаёт новую папку.

source: Move `src_path` to `dst_path`.
ru: Перемещает `src_path` в `dst_path`.

source: source path to be moved
ru: исходный путь, подлежащий перемещению

source: Update custom properties of a resource.
ru: Обновляет пользовательские свойства ресурса.

source: `dict`, custom properties to update
ru: `dict`, новые пользовательские свойства ресурса

source: Check whether the public resource exists.
ru: Проверяет, существует ли публичный ресурс.

source: Get contents of a public directory.
ru: Получает содержимое публичной папки.

source: relative path to the resource in the public folder. By specifying the key of the published folder in `public_key`, you can request contents of any nested folder.
ru: относительный путь к ресурсу в публичной папке. Указывая ключ опубликованной папки через `public_key`, вы можете запросить содержимое любой вложенной папки.

source: Make a resource public.
ru: Делает ресурс публичным.

source: path to the resource to be published
ru: путь к публикуемому ресурсу

source: :any:`AsyncResourceLinkObject`, link to the resource
ru: :any:`AsyncResourceLinkObject`, ссылка на ресурс

source: Refresh an existing token.
ru: Обновляет существующий токен.

source: the refresh token that was received with the token
ru: refresh-токен, полученный вместе с токеном

source: invalid or expired refresh token or it doesn't belong to this application
ru: неправильный или истекший refresh-токен или он не принадлежит этому приложению

source: Remove the resource.
ru: Удаляет ресурс.

source: path to the resource to be removed
ru: путь к удаляемому ресурсу

source: if `True`, the resource will be removed permanently, otherwise, it will be just moved to the trash
ru: если `True`, ресурс будет безвозвратно удалён, иначе ресурс будет перемещён в корзину

source: `str`, MD5 hash of the file to remove
ru: `str`, MD5 хэш файла, подлежащего удалению

source: MD5 check is only available for files
ru: проверка MD5 доступна только для файлов

source: :any:`AsyncOperationLinkObject` if the operation is performed asynchronously, `None` otherwise
ru: :any:`AsyncOperationLinkObject`, если операция выполняется асинхронно, иначе `None`

source: Remove a trash resource.
ru: Удаляет ресурс корзины.

source: path to the trash resource to be deleted
ru: путь к ресурсу корзины, подлежащий удалению

source: Rename `src_path` to have filename `new_name`. Does the same as `move()` but changes only the filename.
ru: Переименовывает `src_path` в `new_name`. Делает то же самое, что и `move()`, за исключением того, что меняет только имя файла.

source: target filename to rename to
ru: новое имя файла, в которое следует переименовать ресурс

source: `new_name` is not a valid filename or `src_path` is root
ru: `new_name` не является допустимым именем файла или `src_path` - корень диска

source: Restore a trash resource. Returns a link to the newly created resource or a link to the asynchronous operation.
ru: Восстанавливает ресурс корзины. Возвращает ссылку на новый ресурс или ссылку на асинхронную операцию.

source: path to the trash resource to restore
ru: путь к восстанавливаему ресурсу

source: `bool`, determines whether the destination can be overwritten
ru: `bool`, определяет может ли путь назначения быть перезаписан

source: Revoke the token.
ru: Отзывает токен.

source: token to revoke, equivalent to `self.token` if `None`
ru: токен, подлежащий отзыву, то же самое, что `self.token`, если `None`

source: specified token doesn't belong to this application
ru: указанный токен не принадлежит данному приложению

source: token could not be revoked because it doesn't have a :code:`device_id`
ru: не удалось отозвать токен, потому что у него нет :code:`device_id`

source: Saves a public resource to the disk. Returns the link to the operation if it's performed asynchronously, or a link to the resource otherwise.
ru: Сохраняет публичный ресурс на диск. Возвращает ссылку на операцию, если сохранение выполняется асинхронно, или возвращает ссылку на ресурс.

source: filename of the saved resource
ru: имя файла/папки, под которым будет сохранён ресурс

source: path to the copied resource in the public folder
ru: путь к копируемому ресурсу в публичной папке

source: path to the destination directory (downloads directory by default)
ru: путь к папке назначения (загрузки по умолчанию)

source: Check whether the trash resource at `path` exists.
ru: Проверяет, существует ли `path` в корзине.

source: Get contents of a trash resource.
ru: Получает содержимое папки в корзине.

source: path to the directory in the trash bin
ru: путь к папке в корзине

source: async generator of :any:`AsyncTrashResourceObject`
ru: асинхронный генератор :any:`AsyncTrashResourceObject`

source: Make a public resource private.
ru: Делает публичный ресурс приватным.

source: path to the resource to be unpublished
ru: путь к ресурсу, подлежащему депубликации

source: Upload a file to disk.
ru: Загружает файл на диск.

source: path, file-like object or an async generator function to be uploaded
ru: путь к файлу, файл-подобный объект или функция, возвращающая асинхронный генератор для загрузки

source: if `True`, the resource will be overwritten if it already exists, an error will be raised otherwise
ru: если `True`, путь назначения может быть перезаписан, иначе будет вызвана ошибка

source: :any:`AsyncResourceLinkObject`, link to the destination resource
ru: :any:`AsyncResourceLinkObject`, ссылка на загруженный ресурс

source: Upload a file to disk using an upload link.
ru: Загружает файл на диск по уже полученной ссылке.

source: upload link
ru: ссылка для загрузки файла

source: Upload a file from URL.
ru: Загружает файл на диск по URL.

source: source URL
ru: исходный URL

source: `bool`, forbid redirects
ru: `bool`, запретить делать перенаправления

source: :any:`AsyncOperationLinkObject`, link to the asynchronous operation
ru: :any:`AsyncOperationLinkObject`, ссылка на асинхронную операцию

source: Wait until an operation is completed. If the operation fails, an exception is raised. Waiting is performed by calling :any:`asyncio.sleep`.
ru: Ждёт, пока операция не будет выполнена. Если выполнение операции не удалось, вызывается исключение. Ожидание осуществляется с помощью вызова :any:`asyncio.sleep`.

source: Exceptions
ru: Исключения

source: Bases: :py:class:`~yadisk.exceptions.RetriableYaDiskError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.RetriableYaDiskError`

source: Raised when an asynchronous operation fails
ru: Вызывается, когда асинхронная операция завершается с ошибкой

source: Bases: :py:class:`~yadisk.exceptions.YaDiskError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.YaDiskError`

source: Raised when a polling timeout occured while waiting for an asynchronous operation
ru: Вызывается, когда произошёл таймаут во время ожидания асинхронной операции

source: Bases: :py:class:`~yadisk.exceptions.BadRequestError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.BadRequestError`

source: Thrown when authorization is currently pending, the application has to wait.
ru: Вызывается, когда авторизация находится в процессе, приложение должно подождать.

source: Thrown when the server returns code 502
ru: Вызывается, когда сервер вернул код 502.

source: Thrown when the server returns code 400.
ru: Вызывается, когда сервер вернул код 400.

source: Thrown when a verification code has invalid format
ru: Вызывается, когда у кода подтверждения неправильный формат

source: Thrown when the server returns code 409.
ru: Вызывается, когда сервер вернул код 409.

source: Bases: :py:class:`~yadisk.exceptions.PathExistsError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.PathExistsError`

source: Thrown when the directory already exists.
ru: Вызывается, когда папка уже существует.

source: Thrown when the request contains fields with invalid data.
ru: Вызывается, когда запрос содежит поля с некорректными данными.

source: Thrown when the server returns code 403.
ru: Вызывается, когда сервер вернул код 403.

source: Thrown when the server returns code 504
ru: Вызывается, когда сервер вернул код 504.

source: Raised when the server returns code 410.
ru: Вызывается, когда сервер вернул код 410.

source: Thrown when the server returns code 507.
ru: Вызывается, когда сервер вернул код 507.

source: Thrown when the server returns code 500.
ru: Вызывается, когда сервер вернул код 500.

source: Thrown when an invalid client ID or client secret was provided
ru: Вызывается, когда был указан неправильный идентификатор или пароль приложения

source: Thrown when a verification code is expired or invalid
ru: Вызывается при неверном или просроченном коде подтверждения

source: Thrown when Yandex.Disk did not return a JSON response or if it's invalid.
ru: Вызывается, когда Яндекс.Диск не вернул JSON ответ или он неправильный.

source: Thrown when the server returns code 423.
ru: Вызывается, когда сервер вернул код 423.

source: Bases: :py:class:`~yadisk.exceptions.ConflictError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.ConflictError`

source: Thrown when the MD5 hash of the file to be deleted doesn't match with the actual one.
ru: Вызывается, когда MD5 хэш удаляемого ресурса не совпадает с указанным.

source: Thrown when the server returns code 406.
ru: Вызывается, когда сервер вернул код 406.

source: Thrown when the server returns code 404.
ru: Вызывается, когда сервер вернул код 404.

source: Bases: :py:class:`~yadisk.exceptions.NotFoundError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.NotFoundError`

source: Thrown by `get_operation_status()` when the operation doesn't exist.
ru: Вызывается, когда операция, переденная `get_operation_status()` не существует.

source: Thrown by `mkdir`, `upload`, etc. when the parent directory doesn't exist.
ru: Вызывается `mkdir`, `upload` и т.д. когда родительская папка не существует.

source: Thrown when the requested path already exists.
ru: Вызывается, когда запрашиваемый путь уже существует.

source: Thrown when the requested path does not exist.
ru: Вызывается, когда запрашиваемый путь не существует.

source: Thrown when the server returns code 413.
ru: Вызывается, когда сервер вернул код 413.

source: Generic exception class for cases when a request could not be sent or response could not be received.
ru: Общий класс исключения для случаев, когда запросы не удалось отправить или не удалось получить ответ.

source: Bases: :py:class:`~yadisk.exceptions.RequestError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.RequestError`

source: Thrown when a request timed out.
ru: Вызывается, когда время ожидания запроса истекло.

source: Bases: :py:class:`~yadisk.exceptions.TooManyRequestsError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.TooManyRequestsError`

source: Raised when the download limit for a resource is exceeded.
ru: Вызывается, когда превышен лимит на скачивание для ресурса.

source: Bases: :py:class:`~yadisk.exceptions.LockedError`
ru: Базовые классы: :py:class:`~yadisk.exceptions.LockedError`

source: Thrown when the resource is locked by another operation.
ru: Вызывается, когда запрашиваемый ресурс заблокирован другой операцией.

source: Thrown when there was an error but it would make sense to retry the request.
ru: Вызывается в случае, если произошла ошибка, но имеет смысл повторить запрос.

source: Thrown when there were too many redirects.
ru: Вызывается, при слишком большом количестве перенаправлений.

source: Thrown when the server returns code 429.
ru: Вызывается, когда сервер вернул код 429.

source: Thrown when the server returns code 401.
ru: Вызывается, когда сервер вернул код 401.

source: Thrown when the server returns code 503.
ru: Вызывается, когда сервер вернул код 503.

source: Thrown when the request failed but the response does not contain any error info.
ru: Вызывается, когда запрос не удался, но не содержит информации об ошибке.

source: Thrown when the server returns code 415.
ru: Вызывается, когда сервер вернул код 415.

source: Thrown when the specified token cannot be used in a request
ru: Вызывается, когда указанный токен не может быть использован в запросе

source: Thrown when upload limit has been exceeded.
ru: Вызывается, когда превышен лимит на загрузку файлов.

source: Thrown when the resource was expected to be of different type (e.g., file instead of directory).
ru: Вызывается, когда ожидался ресурс другого типа (например, файл вместо папки).

source: Thrown when a connection error occured.
ru: Вызывается при ошибке соединения.

source: Bases: :py:class:`Exception`
ru: Базовые классы: :py:class:`Exception`

source: Base class for all exceptions in this library.
ru: Базовый класс для всех исключений в этой библиотеке.

source: `str`, unique error code as returned by API
ru: `str`, уникальный код ошибки, полученный от API

source: an instance of :any:`Response` or :any:`AsyncResponse`
ru: объект :any:`Response` или :any:`AsyncResponse`

source: `bool`, if set to :code:`True`, exception will not trigger a retry in :any:`utils.auto_retry()`
ru: `bool`, если :code:`True`, исключение не вызовет повторную попытку в :any:`utils.auto_retry()`

source: `str`, exception message
ru: `str`, сообщение исключения

source: Contents:
ru: Содержание:

source: API Reference
ru: Справочник API

source: Response Objects
ru: Объекты ответов сервера

source: Bases: :py:class:`~yadisk.objects._resources.FilesResourceListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.FilesResourceListObject`

source: Flat list of files.
ru: Плоский список файлов.

source: `dict` or `None`
ru: `dict` или `None`

source: :any:`AsyncClient` or `None`, `YaDisk` object
ru: :any:`AsyncClient` или `None`, объект `YaDisk`

source: `list`, flat list of files (:any:`AsyncResourceObject`)
ru: `list`, плоский список файлов (:any:`AsyncResourceObject`)

source: `int`, maximum number of elements in the list
ru: `int`, максимальное число элементов в списке

source: `int`, offset from the beginning of the list
ru: `int`, отступ от начала списка

source: Bases: :py:class:`~yadisk.objects._resources.LastUploadedResourceListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.LastUploadedResourceListObject`

source: List of last uploaded resources.
ru: Список последних загруженных файлов.

source: `list`, list of resources (:any:`AsyncResourceObject`)
ru: `list`, список ресурсов (:any:`AsyncResourceObject`)

source: Bases: :py:class:`~yadisk.objects._operations.OperationLinkObject`
ru: Базовые классы: :py:class:`~yadisk.objects._operations.OperationLinkObject`

source: Operation link object.
ru: Объект ссылки на операцию.

source: `str`, link URL
ru: `str`, URL ссылки

source: `str`, HTTP method
ru: `str`, HTTP метод

source: `bool`, tells whether the URL is templated
ru: `bool`, признак шаблонизированного URL

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourceLinkObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourceLinkObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`

source: Public resource link object.
ru: Объект ссылки на публичный ресурс.

source: `str`, public key of the resource
ru: `str`, публичный ключ к ресурсу

source: `str`, public URL of the resource
ru: `str`, публичный URL ресурса

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourceListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourceListObject`

source: List of public resources.
ru: Список публичных ресурсов.

source: `str`, sort type
ru: `str`, тип сортировки

source: `str`, path to the directory that contains the elements of the list
ru: `str`, путь к папке, содержащей элементы списка

source: `int`, number of elements in the list
ru: `int`, количество элементов списка

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourceObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourceObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`

source: Public resource object.
ru: Объект публичного ресурса.

source: `str`, antivirus check status
ru: `str`, статус проверки антивирусом

source: `str`, download URL
ru: `str`, URL для скачивания файла

source: `int`, file size
ru: `int`, размер файла

source: `str`, public resource key
ru: `str`, публичный ключ

source: `str`, SHA256 hash
ru: `str`, SHA256 хэш

source: `str`, MD5 hash
ru: `str`, MD5 хэш

source: :any:`AsyncPublicResourceObject`, list of nested resources
ru: :any:`AsyncPublicResourceObject`, список вложенных ресурсов

source: `str`, filename
ru: `str`, имя файла

source: :any:`EXIFObject`, EXIF metadata
ru: :any:`EXIFObject`, метаданные EXIF

source: `str`, resource ID
ru: `str`, идентификатор ресурса

source: `dict`, custom resource properties
ru: `dict`, пользовательские свойства ресурса

source: `str`, public URL
ru: `str`, публичный URL

source: :any:`ShareInfoObject`, shared folder information
ru: :any:`ShareInfoObject`, информация об общей папке

source: :any:`datetime.datetime`, date of last modification
ru: :any:`datetime.datetime`, дата последнего изменения

source: :any:`datetime.datetime`, date of creation
ru: :any:`datetime.datetime`, дата создания

source: :any:`datetime.datetime`, photo/video creation date
ru: :any:`datetime.datetime`, дата создания фото/видео

source: `str`, MIME type
ru: `str`, MIME-тип

source: `str`, path to the resource
ru: `str`, путь к ресурсу

source: `str`, file preview URL
ru: `str`, URL превью файла

source: :any:`CommentIDsObject`, comment IDs
ru: :any:`CommentIDsObject`, идентификаторы комментариев

source: `str`, type ("file" or "dir")
ru: `str`, тип ("file" или "dir")

source: `str`, file type as determined by Yandex.Disk
ru: `str`, тип файла, согласно Яндекс.Диску

source: `int`, Yandex.Disk revision at the time of last modification
ru: `int`, ревизия Яндекс.Диска на момент последнего изменения

source: `int`, number of times the public resource was viewed
ru: `int`, количество просмотров публичного ресурса

source: :any:`UserPublicInfoObject`, owner of the public resource
ru: :any:`UserPublicInfoObject`, владелец публичного ресурса

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourcesListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourcesListObject`

source: `list`, list of public resources (:any:`AsyncPublicResourceObject`)
ru: `list`, список публичных ресурсов (:any:`AsyncPublicResourceObject`)

source: `str`, resource type to filter by
ru: `str`, тип ресурса по которому фильтровать

source: Bases: :py:class:`~yadisk.objects._resources.ResourceLinkObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceLinkObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`

source: Resource link object.
ru: Объект ссылки на ресурс.

source: Bases: :py:class:`~yadisk.objects._resources.ResourceListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceListObject`

source: List of resources.
ru: Список ресурсов.

source: Bases: :py:class:`~yadisk.objects._resources.ResourceObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceObject`, :py:class:`~yadisk.objects._resources.AsyncResourceObjectMethodsMixin`

source: Resource object.
ru: Объект ресурса.

source: :any:`AsyncResourceListObject`, list of nested resources
ru: :any:`AsyncResourceListObject`, список вложенных ресурсов

source: `dict[str, str]`, mapping of all preview sizes, where keys are names and values are download links
ru: `dict[str, str]`, соответствие всех размеров превью, где ключи - названия размеров, а значения - ссылки для скачивания превью

source: Bases: :py:class:`~yadisk.objects._resources.TrashResourceListObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.TrashResourceListObject`

source: List of trash resources.
ru: Список ресурсов корзины.

source: `list`, list of resources (:any:`AsyncTrashResourceObject`)
ru: `list`, список ресурсов (:any:`AsyncTrashResourceObject`)

source: Bases: :py:class:`~yadisk.objects._resources.TrashResourceObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.TrashResourceObject`

source: Trash resource object.
ru: Объект ресурса корзины.

source: :any:`AsyncTrashResourceListObject`, list of nested resources
ru: :any:`AsyncTrashResourceListObject`, список вложенных ресурсов

source: `str`, original path
ru: `str`, оригинальный путь

source: :any:`datetime.datetime`, date of deletion
ru: :any:`datetime.datetime`, дата удаления

source: Check whether the trash resource exists.
ru: Проверяет, существует ли ресурс в корзине.

source: `str` or `None`, relative path to the trash resource
ru: `str` или `None`, относительный путь к ресурсу

source: Check whether resource is a trash directory.
ru: Проверяет, является ли ресурс папкой в корзине.

source: Check whether resource is a trash file.
ru: Проверяет, является ли ресурс файлом в корзине.

source: `str` or `None`, relative path to the directory in the trash bin
ru: `str` или `None`, относительный путь к папке в корзине

source: generator of :any:`AsyncTrashResourceObject`
ru: генератор :any:`AsyncTrashResourceObject`

source: `str` or `None`, relative path to the trash resource to be deleted
ru: `str` или `None`, относительный путь к ресурсу корзины, подлежащий удалению

source: This method takes 1 or 2 positional arguments:
ru: Данный метод принимает 1 или 2 позиционных аргумента:

source: `str` or `None`, relative path to the trash resource to be restored
ru: `str` или `None`, относительный путь к восстанавливаему ресурсу

source: Bases: :py:class:`~yadisk.objects._yadisk_object.YaDiskObject`
ru: Базовые классы: :py:class:`~yadisk.objects._yadisk_object.YaDiskObject`

source: Comment IDs object.
ru: Список идентификаторов комментариев.

source: :any:`Client`/:any:`AsyncClient` or `None`, `YaDisk` object
ru: :any:`Client`/:any:`AsyncClient` или `None`, объект `YaDisk`

source: `str`, comment ID for private resources
ru: `str`, идентификатор комментария для приватных ресурсов

source: `str`, comment ID for public resources
ru: `str`, идентификатор комментария для публичных ресурсов

source: Result of :any:`Client.get_device_code()` / :any:`AsyncClient.get_device_code()`.
ru: Результат :any:`Client.get_device_code()` / :any:`AsyncClient.get_device_code()`.

source: :any:`YaDisk` or `None`, `YaDisk` object
ru: :any:`YaDisk` или `None`, объект `YaDisk`

source: `str`, device code that can be used for obtaining the token
ru: `str`, код устройства, который может быть использован для получения токена

source: `str`, code that the user should enter on the OAuth page
ru: `str`, код, который пользователь должен ввести на странице OAuth

source: `str`, URL of the OAuth page where user is expected to enter the :code:`user_code`
ru: `str`, URL страницы OAuth, на которой пользователь должен ввести :code:`user_code`
