Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/api_reference.po
Languages: ru

source: Base URL for Yandex.Disk's OAuth API. Can be overriden for testing and other purposes
ru: Базовый URL для OAuth API Яндекс.Диска. Может быть переопределён для тестирования и прочих целей

source: `int`, default number of retries
ru: `int`, число повторных попыток запроса по умолчанию

source: `float`, default retry interval
ru: `float`, стандартная задержка между повторными попытками

source: `tuple` of 2 numbers (`int` or `float`), default timeout for requests. First number is the connect timeout, the second one is the read timeout.
ru: `tuple` из 2-х чисел (`int` или `float`), стандартный таймаут для запросов. Первое число - это таймаут соединения, второе - таймаут чтения.

source: Analogous to :any:`settings.DEFAULT_RETRY_INTERVAL` but for :any:`Client.upload()`/:any:`AsyncClient.upload()` function
ru: Аналогично :any:`settings.DEFAULT_RETRY_INTERVAL`, но для функции :any:`Client.upload()`/:any:`AsyncClient.upload()`

source: Analogous to :any:`settings.DEFAULT_TIMEOUT` but for :any:`Client.upload()`/:any:`AsyncClient.upload()` function
ru: Аналогично :any:`settings.DEFAULT_TIMEOUT`, но для функции :any:`Client.upload()`/:any:`AsyncClient.upload()`

source: Logger for the library. Logs include information about requests to the API and automatic retry attempts.
ru: Логгер библиотеки. Логи включают в себя информацию о запросах к API и автоматических повторных попытках.

source: Synchronous API
ru: Синхронный API

source: Implements access to Yandex.Disk REST API (provides synchronous API).
ru: Реализует доступ к REST API Яндекс.Диска (предоставляет синхронный API).

source: HTTP client implementation can be specified using the :code:`session` parameter. :any:`RequestsSession` is used by default. For other options, see :doc:`/api_reference/sessions`.
ru: Реализация HTTP-клиента может быть указана с помощью параметра `session`. По умолчанию используется :any:`RequestsSession`. см. :doc:`/api_reference/sessions` для других списка других доступных вариантов.

source: Almost all methods of :any:`Client` (the ones that accept `**kwargs`) accept some additional arguments:
ru: Почти все методы :any:`Client` (те, которые принимают `**kwargs`) принимают некоторые дополнительные параметры:

source: Additional parameters, specific to a given HTTP client library can also be passed, see documentation for specific :any:`Session` subclasses (:doc:`/api_reference/sessions`).
ru: Дополнительные параметры, относящиеся к конкретной HTTP библиотеке могут также быть переданы, см. документацию для конкретных подклассов :any:`Session` (:doc:`/api_reference/sessions`).

source: `None`, `str` or an instance of :any:`Session`. If :code:`session` is a string, the appropriate session class will be imported, it must be one of the following values: * :code:`"httpx"` - :any:`HTTPXSession` * :code:`"pycurl"` - :any:`PycURLSession` * :code:`"requests"` - :any:`RequestsSession`
ru: `None`, `str` или объект :any:`Session`. Если :code:`session` - строка, то нужный класс будет автоматически импортирован, допустимые значения: * :code:`"httpx"` - :any:`HTTPXSession` * :code:`"pycurl"` - :any:`PycURLSession` * :code:`"requests"` - :any:`RequestsSession`

source: `None`, `str` or an instance of :any:`Session`. If :code:`session` is a string, the appropriate session class will be imported, it must be one of the following values:
ru: `None`, `str` или объект :any:`Session`. Если :code:`session` - строка, то нужный класс будет автоматически импортирован, допустимые значения:

source: `None` or a function that opens a file for reading or writing (:code:`open()` by default)
ru: `None` или функция, которая открывает файл для чтения или записи (:code:`open()` по умолчанию)

source: kept for compatibility, callable that returns an instance of :any:`Session`
ru: оставлен для совместимости, функция, возвращающая объект :any:`Session`

source: current session (:any:`Session` instance)
ru: текущая сессия (объект :any:`Session`)

source: function that opens a file for reading or writing (:code:`open()` by default)
ru: функция, которая открывает файл для чтения или записи (:code:`open()` по умолчанию)

source: This method can also be called implicitly by using the `with` statement.
ru: Этот метод может также быть вызван неявно с помощью конструкции `with`.

source: :any:`SyncResourceLinkObject`, link to the source resource
ru: :any:`SyncResourceLinkObject`, ссылка на исходный ресурс

source: public key or public URL of the public resource
ru: публичный ключ или URL к публичному ресурсу

source: generator of :any:`SyncPublicResourceObject`
ru: генератор :any:`SyncPublicResourceObject`

source: This request is used for authorization using the Yandex OAuth page. In this case the user must enter the verification code (:code:`user_code`) in the browser on the Yandex OAuth page. After the user has entered the code on the OAuth page, the application can exchange the :code:`device_code` for the token using the :any:`Client.get_token_from_device_code()`.
ru: Данный запрос используется для авторизации с помощью страницы Яндекс OAuth. В данном случае пользователь должен ввести код подтверждения (:code:`user_code`) в браузере на странице Яндекс OAuth. После того как пользователь ввёл код, приложение может обменять :code:`device_code` на токен с помощью метода :any:`Client.get_token_from_device_code()`.

source: invalid client ID
ru: неправильный идентификатор приложения

source: generator of :any:`ResourceObject`
ru: генератор :any:`ResourceObject`

source: :any:`SyncPublicResourcesListObject`
ru: :any:`SyncPublicResourceObject`

source: Get a new token from a device code, previously obtained with :any:`Client.get_device_code()`.
ru: Получает новый токен с помощью кода устройства (device_code), полученного с помощью :any:`Client.get_device_code()`

source: device code, obtained from :any:`Client.get_device_code()`
ru: код устройства (device_code), полученный с помощью :any:`Client.get_device_code()`

source: Get a link to upload the file using the PUT request. This is similar to :any:`Client.get_upload_link()`, except it returns an instance of :any:`ResourceUploadLinkObject` which also contains an asynchronous operation ID.
ru: Получает ссылку для загрузки файла на диск при помощи PUT запроса. Этот метод аналогичен :any:`Client.get_upload_link()`, но возвращает объект :any:`ResourceUploadLinkObject`, который также содержит идентификатор асинхронной операции.

source: Check whether the public resource is a public directory.
ru: Проверяет, является ли публичный ресурс публичной папкой.

source: Check whether the public resource is a public file.
ru: Проверяет, является ли публичный ресурс публичным файлом.

source: :any:`SyncResourceLinkObject`, link to the resource
ru: :any:`SyncResourceLinkObject`, ссылка на ресурс

source: path to the trash resource to be restored
ru: путь к восстанавливаему ресурсу

source: token to revoke
ru: токен, подлежащий отзыву

source: path, file-like object to be uploaded or a function that returns an iterator (or generator)
ru: путь, файл-подобный объект, который нужно загрузить, или функция, которая возвращает итератор (или генератор)

source: :any:`SyncResourceLinkObject`, link to the destination resource
ru: :any:`SyncResourceLinkObject`, ссылка на загруженный ресурс

source: :any:`SyncOperationLinkObject`, link to the asynchronous operation
ru: :any:`SyncOperationLinkObject`, ссылка на асинхронную операцию

source: Types
ru: Типы

source: :any:`Client` or :any:`AsyncClient`
ru: :any:`Client` или :any:`AsyncClient`

source: :any:`Response` or :any:`AsyncResponse`
ru: :any:`Response` или :any:`AsyncResponse`

source: Callback function (may be asynchronous) that is invoked to consume the streamed HTTP response body
ru: Функция обратного вызова (может быть асинхронной), которая вызывается для "потребления" тела HTTP-запроса

source: Bases: :py:class:`~typing.Protocol`
ru: Базовые классы: :py:class:`~typing.Protocol`

source: This protocol describes the bare minimum set of required methods for an async file-like object (open in either binary or unicode mode).
ru: Данный протокол описывает минимальный набор методов для асинхронного файл-подобного объекта (открытого либо в бинарном или текстовом режиме).

source: Reads `size` bytes or characters.
ru: Считывает `size` байт или символов

source: `int`, number of bytes/characters to read from the file
ru: `int`, число байт/символов, которые нужно считать

source: data that was read from the file
ru: данные, которые были прочитаны из файла

source: Performs a seek operation on a file.
ru: Выполняет операцию seek над файлом

source: `int`, position to seek to
ru: `int`, позиция

source: `int`, 0 (seek absolute position), 1 (seek relative to current position) or 2 (seek to file's end)
ru: `int`, 0 (абсолютное позиционирование), 1 (относительное позиционирование) или 2 (позиционирование относительно конца файла)

source: `int`, absolute position within the file after the seek operation
ru: `int`, абсолютная позиция внутри файла после операции seek

source: Returns current position within the file.
ru: Возвращает текущую позицию внутри файла

source: `int`, current position within the file
ru: `int`, текущая позиция внутри файла

source: Writes data (contained in `buffer`).
ru: Записывает данные (содержащейся в `buffer`).

source: data to be written
ru: данные, которые нужно записать

source: the number of written bytes/characters
ru: число записанных байт/символов

source: This is used to specify a source file to upload (async variant)
ru: Используется для указания исходного файла для загрузки на сервер (асинхронный вариант)

source: This is used to specify a destination file to download into (async variant)
ru: Используется для указания файла назначения, в который будут скачаны данные (асинхронный вариант)

source: Function that is used for opening local files (async variant)
ru: Функция, которая используется для открытия локальных файлов (асинхронный вариант)

source: Request payload - data to be uploaded (async variant)
ru: Полезная нагрузка запроса - данные, которые будут загружены на сервер (асинхронный вариант)

source: Function that returns an instance of :any:`AsyncSession`
ru: Функция, возвращающая объект :any:`AsyncSession`

source: Valid asynchronous session name (see :doc:`/api_reference/sessions`)
ru: Имя асинхронной сессии (см. :doc:`/api_reference/sessions`)

source: This protocol describes the bare minimum set of required methods for an async file-like object open in binary mode.
ru: Данный протокол описывает минимальный набор методов для асинхронного файл-подобного объекта, открытого в бинарном режиме.

source: Reads `size` bytes.
ru: Считывает `size` байт.

source: the number of written bytes
ru: число записанных байт

source: Callback function that is invoked to consume the streamed HTTP response body
ru: Функция обратного вызова, которая вызывается для "потребления" тела HTTP-запроса

source: File mode for :any:`OpenFileCallback` and :any:`AsyncOpenFileCallback`
ru: Режим открытия файла для :any:`OpenFileCallback` и :any:`AsyncOpenFileCallback`

source: This is used to specify a source file to upload
ru: Используется для указания исходного файла для загрузки на сервер

source: This is used to specify a destination file to download into
ru: Используется для указания файла назначения, в который будут скачаны данные

source: HTTP request method
ru: Метод HTTP запроса

source: Type used for passing HTTP request headers
ru: Тип используемый для задания заголовков HTTP запросов

source: JSON data (parsed)
ru: Данные JSON (после парсинга)

source: Function that is used for opening local files (like :any:`open`)
ru: Функция, которая используется для открытия локальных файлов (как :any:`open`)

source: Yandex.Disk's asynchronous operation status
ru: Статус асинхронной операции Яндекс.Диска

source: Request payload - data to be uploaded
ru: Полезная нагрузка запроса - данные, которые будут загружены на сервер

source: Function that returns an instance of :any:`Session`
ru: Функция, возвращающая объект :any:`Session`

source: Valid session name (see :doc:`/api_reference/sessions`)
ru: Имя сессии (см. :doc:`/api_reference/sessions`)

source: Request timeout (in seconds). Can be a single number, None or a tuple. If the timeout is specified as a tuple, then the first value is the connect timeout, and the second value is the read timeout. Otherwise, both connect and read timeouts are set to the same value. A value of None means no timeout. If the timeout's value is :code:`...`, the default timeout is used (either :any:`settings.DEFAULT_TIMEOUT` or :any:`settings.DEFAULT_UPLOAD_TIMEOUT`)
ru: Таймаут запроса (в секундах). Может быть числом, None или кортежем. Если таймаут задан как кортеж, то первое значение - таймаут соединения, а второе - таймаут чтения. Иначе, заданное значение используется для обоих таймаутов. Значение None означает отсутствие таймаута. Если в качестве таймаута передано значение :code:`...`, то используется таймаут по умолчанию (:any:`settings.DEFAULT_TIMEOUT` или :any:`settings.DEFAULT_UPLOAD_TIMEOUT`)

source: Utilities
ru: Вспомогательные средства

source: A case-insensitive dictionary. All keys are converted to lowercase.
ru: Словарь, нечувствительный к регистру. Все ключи преобразуются в нижний регистр.

source: Attempt to perform a request with automatic retries. A retry is triggered by :any:`RequestError` or :any:`RetriableYaDiskError`, unless the raised exception has :code:`disable_retry` set to :code:`True`.
ru: Выполняет запрос с автоматическими повторными попытками. Повторная попытка может быть вызвана :any:`RequestError` или :any:`RetriableYaDiskError`, если у исключения не задан атрибут :code:`disable_retry=True`.

source: function to run, must not require any arguments
ru: Функция, подлежащая исполнению, не должна требовать аргументов

source: `int` or `float`, delay between retries (in seconds)
ru: `int` или `float`, задержка между повторными попытками в секундах

source: `tuple` or `None`, additional arguments for `func`
ru: `tuple` или `None`, дополнительные аргументы для `func`

source: `dict` or `None`, additional keyword arguments for `func`
ru: `dict` или `None`, дополнительные keyword-аргументы для `func`

source: return value of func()
ru: Значение, возвращаемое func()

source: Get an exception instance based on response, assuming the request has failed.
ru: Возвращает объект исключения, основываясь на ответе (подразумевается, что запрос не удался).

source: an instance of :any:`ErrorObject` or `None`
ru: экземпляр :any:`ErrorObject` или `None`

source: an exception instance, subclass of :any:`YaDiskError`
ru: Объект исключения, подкласс :any:`YaDiskError`
