Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/api_reference.po
Languages: ru

source: Asynchronous API
ru: Асинхронный API

source: Implements access to Yandex.Disk REST API (provides asynchronous API).
ru: Реализует доступ к REST API Яндекс.Диска (реализует асинхронный API).

source: HTTP client implementation can be specified using the :code:`session` parameter. :any:`AsyncHTTPXSession` is used by default. For other options, see :doc:`/api_reference/sessions`.
ru: Реализация HTTP-клиента может быть указана с помощью параметра :code:`session`. По умолчанию используется :any:`AsyncHTTPXSession`. см. :doc:`/api_reference/sessions` для других списка других доступных вариантов.

source: Almost all methods of :any:`AsyncClient` (the ones that accept `**kwargs`) accept some additional arguments:
ru: Почти все методы :any:`AsyncClient` (те, которые принимают `**kwargs`) принимают некоторые дополнительные параметры:

source: **n_retries** - `int`, maximum number of retries for a request
ru: **n_retries** - `int`, максимальное число повторных попыток запроса

source: **retry_interval** - `float`, delay between retries (in seconds)
ru: **retry_interval** - `float`, задержка между повторными попытками (в секундах)

source: **headers** - `dict` or `None`, additional request headers
ru: **headers** - `dict` или `None`, дополнительные заголовки запроса

source: **timeout** - `tuple` (:code:`(<connect timeout>, <read timeout>)`) or `float` (specifies both connect and read timeout), request timeout (in seconds)
ru: **timeout** - `tuple` (:code:`(<connect timeout>, <read timeout>)`) или `float` (указывает одновременно и connect и read timeout), таймаут запроса в секундах

source: Additional parameters, specific to a given HTTP client library can also be passed, see documentation for specific :any:`AsyncSession` subclasses (:doc:`/api_reference/sessions`).
ru: Дополнительные параметры, относящиеся к конкретной HTTP библиотеке могут также быть переданы, см. документацию для конкретных подклассов :any:`AsyncSession` (:doc:`/api_reference/sessions`).

source: Do not forget to call :any:`AsyncClient.close` or use the `async with` statement to close all the connections. Otherwise, you may get a warning.
ru: Не забывайте вызывать :any:`AsyncClient.close` или используйте `async with`, чтобы закрыть все соединения. Иначе, вы можете получить предупреждение.

source: In :any:`Client` this is handled in the destructor, but since :any:`AsyncClient.close` is a coroutine function the same cannot be done here, so you have to do it explicitly.
ru: В :any:`Client` это делалается в деструкторе, но т.к. :any:`AsyncClient.close` - корутина, здесь этого сделать нельзя, поэтому приходится делать это явно.

source: Parameters
ru: Параметры

source: application ID
ru: идентификатор приложения

source: application secret password
ru: пароль приложения

source: application token
ru: токен

source: `dict` or `None`, default arguments for methods. Can be used to set the default timeout, headers, etc.
ru: `dict` или `None`, аргументы по умолчанию для методов. Можно использовать, чтобы задать стандартный таймаут, заголовки и т.д.

source: `None`, `str` or an instance of :any:`AsyncSession`. If :code:`session` is a string, the appropriate session class will be imported, it must be one of the following values: * :code:`"aiohttp"` - :any:`AIOHTTPSession` * :code:`"httpx"` - :any:`AsyncHTTPXSession`
ru: `None`, `str` или объект :any:`AsyncSession`. Если :code:`session` - строка, то нужный класс будет автоматически импортирован, допустимые значения: * :code:`"aiohttp"` - :any:`AIOHTTPSession` * :code:`"httpx"` - :any:`AsyncHTTPXSession`

source: `None`, `str` or an instance of :any:`AsyncSession`. If :code:`session` is a string, the appropriate session class will be imported, it must be one of the following values:
ru: `None`, `str` или объект :any:`AsyncSession`. Если :code:`session` - строка, то нужный класс будет автоматически импортирован, допустимые значения:

source: `None` or an async function that opens a file for reading or writing (:code:`aiofiles.open()` by default)
ru: `None` или асинхронная функция, которая открывает файл для чтения или записи (:code:`aiofiles.open()` по умолчанию)

source: kept for compatibility, callable that returns an instance of :any:`AsyncSession`
ru: оставлен для совместимости, функция, возвращающая объект :any:`AsyncSession`

source: Variables
ru: Атрибуты

source: `str`, application ID
ru: `str`, идентификатор приложения

source: `str`, application secret password
ru: `str`, пароль приложения

source: `str`, application token
ru: `str`, токен

source: `dict`, default arguments for methods. Can be used to set the default timeout, headers, etc.
ru: `dict`, аргументы по умолчанию для методов. Можно использовать, чтобы задать стандартный таймаут, заголовки и т.д.

source: current session (:any:`AsyncSession` instance)
ru: текущая сессия (объект :any:`AsyncSession`)

source: async function that opens a file for reading or writing (:code:`aiofiles.open()` by default)
ru: асинхронная функция, которая открывает файл для чтения или записи (:code:`aiofiles.open()` по умолчанию)

source: The following exceptions may be raised by most API requests:
ru: Большинство запросов к API могут вызвать следующие исключения:

source: Raises
ru: Вызывает

source: HTTP client raised an exception while making a request
ru: HTTP-клиент вызвал исключение во время отправления запроса

source: server returned HTTP code 400
ru: сервер вернул код 400.

source: request contains fields with invalid data
ru: запрос содежит поля с некорректными данными.

source: server returned HTTP code 401
ru: сервер вернул код 401.

source: server returned HTTP code 403
ru: сервер вернул код 403.

source: server returned HTTP code 406
ru: сервер вернул код 406.

source: server returned HTTP code 409
ru: сервер вернул код 409.

source: server returned code 413
ru: сервер вернул код 413.

source: server returned HTTP code 415
ru: сервер вернул код 415.

source: server returned HTTP code 423
ru: сервер вернул код 423.

source: server returned HTTP code 429
ru: сервер вернул код 429.

source: server returned HTTP code 500
ru: сервер вернул код 500.

source: server returned HTTP code 502
ru: сервер вернул код 502.

source: server returned HTTP code 503
ru: сервер вернул код 503.

source: server returned HTTP code 504
ru: сервер вернул код 504.

source: server returned HTTP code 509
ru: сервер вернул код 509.

source: other unknown error
ru: другая неизвестная ошибка

source: Check whether the token is valid.
ru: Проверяет, действителен ли токен.

source: token to check, equivalent to `self.token` if `None`
ru: токен, подлежащий проверке, то же самое, что `self.token` при `None`

source: `float`, `tuple` or `None`, request timeout
ru: `float`, `tuple` или `None`, таймаут запроса

source: `dict` or `None`, additional request headers
ru: `dict` или `None`, дополнительные заголовки запроса

source: `int`, maximum number of retries
ru: `int`, максимальное число повторных попыток запроса

source: delay between retries in seconds
ru: задержка между повторными попытками в секундах

source: `tuple`, additional exception classes to retry on
ru: `tuple`, дополнительные классы исключений, которые вызовут повторную попытку

source: `dict`, additional parameters for :any:`AIOHTTPSession`
ru: `dict`, дополнительные параметры для :any:`AIOHTTPSession`

source: `dict`, additional parameters for :any:`AsyncHTTPXSession`
ru: `dict`, дополнительные параметры для :any:`AsyncHTTPXSession`

source: any other parameters, accepted by :any:`Session.send_request()`
ru: другие параметры для :any:`Session.send_request()`

source: Returns
ru: Возвращает

source: Closes the session. Do not call this method while there are other active threads using this object.
ru: Закрывает сессию. Не вызывайте этот метод, пока другие потоки используют этот объект.

source: This method can also be called implicitly by using the `async with` statement.
ru: Этот метод неявно вызывается конструкцией `async with`.

source: Copy `src_path` to `dst_path`. If the operation is performed asynchronously, returns the link to the operation, otherwise, returns the link to the newly created resource.
ru: Копирует `src_path` в `dst_path`. Если операция выполняется асинхронно, возвращает ссылку на операцию, иначе, возвращает ссылку на новый ресурс.

source: source path
ru: исходный путь

source: destination path
ru: путь назначения

source: if `True` the destination path can be overwritten, otherwise, an error will be raised
ru: если `True`, путь назначения может быть перезаписан, иначе будет вызвана ошибка

source: forces the operation to be executed asynchronously
ru: заставляет выполнять операцию асинхронно

source: list of keys to be included in the response
ru: список ключей, которые будут включены в ответ

source: `bool`, if :code:`True`, the method will wait until the asynchronous operation is completed
ru: `bool`, если :code:`True`, метод будет ожидать завершения асинхронной операции

source: `float`, interval in seconds between subsequent operation status queries
ru: `float`, интервал в секундах между проверками статуса операции

source: `float` or `None`, total polling timeout (`None` means no timeout), if this timeout is exceeded, an exception is raised
ru: `float` or `None`, таймаут ожидания операции (`None` означает отсутствие таймаута), если этот таймаут превышен, будет вызвано исключение

source: resource was not found on Disk
ru: ресурс не был найден на Диске

source: destination path already exists
ru: путь назначения уже существует

source: application doesn't have enough rights for this request
ru: у приложения не хватает прав, чтобы выполнить данный запрос

source: cannot complete request due to lack of storage space
ru: невозможно выполнить запрос из-за нехватки свободного места на Диске

source: resource is locked by another request
ru: запрашиваемый ресурс заблокирован другой операцией

source: upload limit has been exceeded
ru: достигнут лимит на загрузку файлов

source: requested operation was not found
ru: указанная операция не найдена

source: requested operation failed
ru: не удалось совершить операцию

source: requested operation did not complete in specified time (when `poll_timeout` is not `None`)
ru: указанная операция не завершилась в указанное время (когда `poll_timeout` не `None`)

source: :any:`AsyncResourceLinkObject` or :any:`AsyncOperationLinkObject`
ru: :any:`AsyncResourceLinkObject` или :any:`AsyncOperationLinkObject`

source: Download the file.
ru: Скачивает файл.

source: destination path or file-like object
ru: путь назначения или файл-подобный объект

source: :any:`AsyncResourceLinkObject`, link to the source resource
ru: :any:`AsyncResourceLinkObject`, ссылка на исходный ресурс

source: Download the file from the link.
ru: Скачивает файл по уже полученной ссылке.

source: download link
ru: ссылка для скачивания

source: Download the public resource.
ru: Скачивает публичный ресурс.

source: public key or public URL of the resource
ru: публичный ключ или URL к ресурсу

source: relative path to the resource within the public folder
ru: относительный путь к ресурсу внутри публичной папки

source: Check whether `path` exists.
ru: Проверяет, существует ли `path`.

source: path to the resource
ru: путь к ресурсу

source: Get a list of all public resources.
ru: Получает список всех публичных ресурсов.

source: `int` or `None`, maximum number of returned items (`None` means unlimited)
ru: `int` или `None`, максимальное число возвращаемых элементов в списке (`None` означает неограниченное число)

source: offset from the beginning of the list
ru: отступ от начала списка

source: maximum number of elements in the list
ru: максимальное число элементов в списке

source: size of the file preview
ru: размер превью файла

source: `bool`, cut the preview to the size specified in the `preview_size`
ru: `bool`, обрезает превью согласно размеру, заданному в `preview_size`

source: filter based on type of resources ("file" or "dir")
ru: фильтр по типу ресурса ("file" или "dir")

source: `float` or `tuple`, request timeout
ru: `float` или `tuple`, таймаут запроса

source: `dict`, additional parameters for :any:`RequestsSession`
ru: `dict`, Дополнительные параметры для :any:`RequestsSession`

source: `dict`, additional parameters for :any:`HTTPXSession`
ru: `dict`, дополнительные параметры для :any:`HTTPXSession`

source: `dict`, additional options for :any:`PycURLSession`
ru: `duct`, дополнительные опции для :any:`PycURLSession`

source: async generator of :any:`AsyncPublicResourceObject`
ru: асинхронный генератор :any:`AsyncPublicResourceObject`

source: Get authentication URL for the user to go to. This method doesn't send any HTTP requests and merely constructs the URL.
ru: Получает URL для аутентификации для пользователя. Данный метод не отправляет никаких HTTP запросов.

source: response type ("code" to get the confirmation code or "token" to get the token automatically)
ru: тип ответа ("code", чтобы получить код подтверждения или "token", чтобы получить токен автоматически)

source: unique device ID, must be between 6 and 50 characters
ru: уникальный идентификатор устройства, от 6 до 50 символов

source: device name, should not be longer than 100 characters
ru: имя устройства, не более 100 символов

source: the URL to redirect the user to after they allow access to the app, by default, the first redirect URI specified in the app settings is used
ru: URL на который пользователь будет перенаправлен после предоставления доступа приложению, по умолчанию используется первый URI, указанный в настройках приложения

source: doesn't do anything, kept for compatibility
ru: ничего не делает, оставлен для совместимости

source: username or email for the account the token is being requested for
ru: username или email аккаунта, для которого будет получен токен

source: `str`, list of permissions for the application
ru: `str`, список разрешений для приложения

source: `str`, list of optional permissions for the application
ru: `str`, список опциональных разрешений для приложения

source: if True, user will be required to confirm access to the account even if the user has already granted access for the application
ru: Если `True`, пользователь должен будет разрешить доступ к аккаунту, даже если он уже это сделал до этого

source: The state string, which Yandex.OAuth returns without any changes (<= 1024 characters)
ru: Строка состояния, которую Яндекс.OAuth возвращает без изменений (<= 1024 символов)

source: string derived from the generated :code:`code_verifier` value using one of the two possible transformations (plain or S256)
ru: строка, полученная из сгенерированного значения :code:`code_verifier` с помощью одного из двух возможных преобразований (plain или S256)

source: specifies what function was used to transform the :code:`code_verifier` value to :code:`code_challenge`, allowed values are :code:`"plain"` and :code:`"S256"` (recommended). If :code:`"S256"` is used, :code:`code_challenge` must be produced by hashing the :code:`code_verifier` value and encoding it to base64
ru: Указывает функцию, которая будет использована для преобразования значения :code:`code_verifier`, возможные значения: :code:`"plain"` и :code:`"S256"` (рекомендуется). Если используется :code:`"S256"`, значение :code:`code_challenge` должно быть получено путём хэширования значения :code:`code_verifier` и кодирования в base64

source: invalid arguments were passed
ru: были переданы неправильные аргументы

source: authentication URL
ru: URL для аутентификации

source: Get the URL for the user to get the confirmation code. The confirmation code can later be used to get the token. This method doesn't send any HTTP requests and merely constructs the URL.
ru: Получает URL для получения пользователем кода подтверждения. Он может быть использован для получения токена. Данный метод не отправляет никаких HTTP запросов.

source: This request is used for authorization using the Yandex OAuth page. In this case the user must enter the verification code (:code:`user_code`) in the browser on the Yandex OAuth page. After the user has entered the code on the OAuth page, the application can exchange the :code:`device_code` for the token using the :any:`AsyncClient.get_token_from_device_code()`.
ru: Данный запрос используется для авторизации с помощью страницы Яндекс OAuth. В данном случае пользователь должен ввести код подтверждения (:code:`user_code`) в браузере на странице Яндекс OAuth. После того как пользователь ввёл код, приложение может обменять :code:`device_code` на токен с помощью метода :any:`AsyncClient.get_token_from_device_code()`.

source: unique device ID (between 6 and 50 characters)
ru: уникальный идентификатор устройства (между 6 и 50 символами)

source: invalid client ID or client secret
ru: неправильный идентификатор или пароль приложения

source: invalid request parameters
ru: неправильные параметры запроса

source: :any:`DeviceCodeObject` containing :code:`user_code` and :code:`device_code`
ru: :any:`DeviceCodeObject`, содержащий :code:`user_code` и :code:`device_code`

source: Get disk information.
ru: Получает информацию о диске.

source: Get a download link for a file (or a directory).
ru: Получает ссылку на скачивание файла (или папки).

source: Get a flat list of all files (that doesn't include directories).
ru: Получить плоский список всех файлов (без папок).

source: number of list elements to be included in each response
ru: максимальное количество элементов списка в каждом запросе

source: type of files to include in the list
ru: тип файлов, которые будут включены в список

source: `str`, field to be used as a key to sort children resources
ru: `str`, поле используемое для сортировки вложенных ресурсов

source: async generator of :any:`AsyncResourceObject`
ru: асинхронный генератор :any:`AsyncResourceObject`

source: Get the list of latest uploaded files sorted by upload date.
ru: Получает список последних загруженных файлов, отсортированный по дате загрузки.

source: Get meta information about a file/directory.
ru: Получает мета-информацию о ресурсе.

source: number of children resources to be included in the response
ru: количество ресурсов в папке, которые будут включены в ответ

source: number of children resources to be skipped in the response
ru: количество ресурсов в папке, которые будут пропущены

source: Get operation status.
ru: Получает статус операции.

source: ID of the operation or a link
ru: идентификатор операции или ссылка на нее

source: `str`, :code:`"in-progress"` indicates that the operation is currently running, :code:`"success"` indicates that the operation was successful, :code:`"failed"` means that the operation failed
ru: `str`, :code:`"in-progress"` означает, что операция в процессе, :code:`"success"` означает, что операция успешно завершилась, :code:`"failed"` означает, что операция завершилась с ошибкой

source: Get a download link for a public resource.
ru: Получает ссылку на скачивание публичного ресурса.

source: Get meta-information about a public resource.
ru: Получает мета-информацию о публичном ресурсе.

source: relative path to a resource in a public folder. By specifying the key of the published folder in `public_key`, you can request metainformation for any resource in the folder.
ru: относительный путь к ресурсу внутри публичной папки. Указывая ключ опубликованной папки через `public_key`, вы можете запросить метаинформацию любого ресурса внутри неё.

source: offset from the beginning of the list of nested resources
ru: отступ от начала списка вложенных ресурсов

source: maximum number of nested elements to be included in the list
ru: максимальное количество элементов списка вложенных ресурсов

source: file preview size
ru: размер превью файла

source: `bool`, allow preview crop
ru: `bool`, разрешить обрезку превью

source: Get a list of public resources.
ru: Получает список публичных ресурсов.

source: Get public resource type.
ru: Получает тип публичного ресурса.

source: "file" or "dir"
ru: "file" или "dir"

source: Get a new token.
ru: Получает новый токен.

source: confirmation code
ru: код подтверждения

source: `str`, verifier code, used with the PKCE authorization flow
ru: `str`, код верификатора, используемый при авторизации с PKCE

source: confirmation code has invalid format
ru: неправильный формат кода подтверждения

source: invalid or expired confirmation code
ru: неправильный или истекший код

source: Get a new token from a device code, previously obtained with :any:`AsyncClient.get_device_code()`.
ru: Получает новый токен с помощью кода устройства (device_code), полученного с помощью :any:`AsyncClient.get_device_code()`

source: device code, obtained from :any:`AsyncClient.get_device_code()`
ru: код устройства, полученный с помощью :any:`AsyncClient.get_device_code()`

source: user has not authorized the application yet
ru: пользователь ещё не авторизовал приложение

source: :code:`device_code` has invalid format
ru: неправильный формат :code:`device_code`

source: invalid or expired :code:`device_code`
ru: неправильный или истекший :code:`device_code`

source: Get meta information about a trash resource.
ru: Получает мета-информацию о ресурсе корзины.

source: path to the trash resource
ru: путь к ресурсу корзины

source: Get trash resource type.
ru: Получает тип ресурса корзины.

source: Get resource type.
ru: Получает тип ресурса

source: Get a link to upload the file using the PUT request.
ru: Получает ссылку для загрузки файла на диск при помощи PUT запроса.

source: `bool`, determines whether to overwrite the destination
ru: `bool`, определяет, перезаписывать путь назначения или нет

source: parent directory doesn't exist
ru: родительская папка не существует

source: cannot upload file due to lack of storage space
ru: невозможно загрузить файл из-за нехватки места на Диске

source: Get a link to upload the file using the PUT request. This is similar to :any:`AsyncClient.get_upload_link()`, except it returns an instance of :any:`ResourceUploadLinkObject` which also contains an asynchronous operation ID.
ru: Получает ссылку для загрузки файла на диск при помощи PUT запроса. Этот метод аналогичен :any:`AsyncClient.get_upload_link()`, но возвращает объект :any:`ResourceUploadLinkObject`, который также содержит идентификатор асинхронной операции.

source: Check whether `path` is a directory.
ru: Проверяет, является ли `path` папкой.

source: `True` if `path` is a directory, `False` otherwise (even if it doesn't exist)
ru: `True`, если `path` является папкой, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `path` is a file.
ru: Проверяет, является ли `path` файлом.

source: `True` if `path` is a file, `False` otherwise (even if it doesn't exist)
ru: `True`, если `path` является файлом, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `public_key` is a public directory.
ru: Проверяет, является ли `public_key` публичной папкой.

source: `True` if `public_key` is a directory, `False` otherwise (even if it doesn't exist)
ru: `True`, если `public_key` является папкой, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `public_key` is a public file.
ru: Проверяет, является ли `public_key` публичным файлом.

source: `True` if `public_key` is a file, `False` otherwise (even if it doesn't exist)
ru: `True`, если `public_key` является файлом, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `path` is a trash directory.
ru: Проверяет, является ли `path` папкой в корзине.

source: Check whether `path` is a trash file.
ru: Проверяет, является ли `path` файлом в корзине.

source: Get contents of `path`.
ru: Получает содержимое `path`.

source: path to the directory
ru: путь к папке
