Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/api_reference.po
Languages: ru

source: `int`, the minimum interval (in seconds) with which the app must request an OAuth token. If requests come more often, Yandex OAuth may respond with an error
ru: `int`, минимальный интервал времени (в секундах), с которым приложение должно запрашивать OAuth токен. Если запросы будут поступать чаще, Яндекс OAuth может вернуть ошибку

source: `int`, amount of time before the codes expire
ru: `int`, количество времени, после которого коды истекают

source: Disk information object.
ru: Объект информации о диске.

source: `int`, maximum supported file size for a paid account (bytes)
ru: `int`, максимальный поддерживаемый размер файла для платного аккаунта (в байтах)

source: `int`, maximum supported file size (bytes)
ru: `int`, максимальный поддерживаемый размер файла (в байтах)

source: `int`, total disk size (bytes)
ru: `int`, общий размер диска (в байтах)

source: `int`, amount of space used by trash (bytes), part of `used_space`
ru: `int`, размер, занятый мусором (в байтах), часть `used_space`

source: `int`, amount of space used (bytes)
ru: `int`, количество занятого места (в байтах)

source: `bool`, tells if the account is paid or not
ru: `bool`, признак платного аккаунта

source: `bool`, not clear what this is for
ru: `bool`, не ясно, для чего это

source: :any:`datetime.datetime`, Disk registration date
ru: :any:`datetime.datetime`, дата регистрации

source: :any:`SystemFoldersObject`, paths to the system folders
ru: :any:`SystemFoldersObject`, пути к системным папкам

source: :any:`UserObject`, owner of the disk
ru: :any:`UserObject`, владелец диска

source: `bool`, tells whether unlimited autoupload from mobile devices is enabled
ru: `bool`, признак включенной безлимитной автозагрузки с мобильных устройств

source: `int`, current revision of Yandex.Disk
ru: `int`, текущая ревизия Яндекс.Диска

source: `int`, total file size in unlimited photos
ru: `int`, общий размер файлов в фотобезлимите

source: `bool`, tells if the user will be in overdraft upon reaching `free_photounlim_end_date`
ru: `bool`, признак - будет ли пользователь в овердрафте по достижении free_photounlim_end_date

source: `int`, timestamp in ms of expiration date of unlimited photo upload
ru: `int`, timestamp в мс окончания бесплатного места в фотобезлимите

source: `bool`, tells if the user is involved in `payment_flow`
ru: `bool`, признак причастности пользователя к payment_flow

source: EXIF metadata object.
ru: Объект метаданных EXIF.

source: :any:`datetime.datetime`, capture date
ru: :any:`datetime.datetime`, дата съёмки

source: `float`, longitude of the photo's location
ru: `str`, координата съёмки (долгота)

source: `float`, latitude of the photo's location
ru: `str`, координата съёмки (широта)

source: Mirrors Yandex.Disk REST API error object.
ru: Реализует объект ошибки REST API Яндекс.Диска.

source: `YaDisk` or `None`, `YaDisk` object
ru: `YaDisk` или `None`, объект `YaDisk`

source: `str`, human-readable error message
ru: `str`, человеко-читаемое сообщение ошибки

source: `str`, technical error description
ru: `str`, техническое описание ошибки

source: `str`, error code
ru: `str`, уникальный код ошибки

source: `list`, flat list of files (:any:`ResourceObject`)
ru: `list`, плоский список файлов (:any:`ResourceObject`)

source: `list`, list of resources (:any:`ResourceObject`)
ru: `list`, список ресурсов (:any:`ResourceObject`)

source: Link object.
ru: Объект ссылки.

source: Bases: :py:class:`~yadisk.objects._link_object.LinkObject`
ru: Базовые классы: :py:class:`~yadisk.objects._link_object.LinkObject`

source: Operation status object.
ru: Объект статуса операции.

source: `str`, status of the operation
ru: `str`, статус операции

source: Bases: :py:class:`~yadisk.objects._resources.ResourceObject`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceObject`

source: :any:`PublicResourceObject`, list of nested resources
ru: :any:`PublicResourceObject`, список вложенных ресурсов

source: `list`, list of public resources (:any:`PublicResourceObject`)
ru: `list`, список публичных ресурсов (:any:`PublicResourceObject`)

source: Resource download link.
ru: Ссылка для скачивания ресурса.

source: :any:`ResourceListObject`, list of nested resources
ru: :any:`ResourceListObject`, список вложенных ресурсов

source: Resource upload link.
ru: Ссылка для загрузки файла.

source: `str`, ID of the upload operation
ru: `str`, идентификатор операции по загрузке файла

source: Shared folder information object.
ru: Объект информации об общей папке.

source: `bool`, tells whether the folder is root
ru: `bool`, признак того, что папка является корневой

source: `bool`, tells whether the user is the owner of this directory
ru: `bool`, признак того, что пользователь является владельцем этой папки

source: `str`, access rights
ru: `str`, права доступа

source: :any:`Client` or `None`, `YaDisk` object
ru: :any:`Client` или `None`, объект `YaDisk`

source: `list`, flat list of files (:any:`SyncResourceObject`)
ru: `list`, плоский список файлов (:any:`SyncResourceObject`)

source: `list`, list of resources (:any:`SyncResourceObject`)
ru: `list`, список ресурсов (:any:`SyncResourceObject`)

source: Wait until an operation is completed. If the operation fails, an exception is raised. Waiting is performed by calling :any:`time.sleep`.
ru: Ждёт, пока операция не будет выполнена. Если операция не удалась, вызывает исключение. Ожидание осуществляется с помощью вызова :any:`time.sleep`.

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourceLinkObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourceLinkObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`

source: Bases: :py:class:`~yadisk.objects._resources.PublicResourceObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.PublicResourceObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`

source: :any:`SyncPublicResourceObject`, list of nested resources
ru: :any:`SyncPublicResourceObject`, список вложенных ресурсов

source: `list`, list of public resources (:any:`SyncPublicResourceObject`)
ru: `list`, список публичных ресурсов (:any:`SyncPublicResourceObject`)

source: Bases: :py:class:`~yadisk.objects._resources.ResourceLinkObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceLinkObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`

source: Bases: :py:class:`~yadisk.objects._resources.ResourceObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`
ru: Базовые классы: :py:class:`~yadisk.objects._resources.ResourceObject`, :py:class:`~yadisk.objects._resources.ResourceObjectMethodsMixin`

source: :any:`SyncResourceListObject`, list of nested resources
ru: :any:`SyncResourceListObject`, список вложенных ресурсов

source: `list`, list of resources (:any:`SyncTrashResourceObject`)
ru: `list`, список ресурсов (:any:`SyncTrashResourceObject`)

source: :any:`SyncTrashResourceListObject`, list of nested resources
ru: :any:`SyncTrashResourceListObject`, список вложенных ресурсов

source: generator of :any:`SyncTrashResourceObject`
ru: генератор :any:`SyncTrashResourceObject`

source: :any:`SyncOperationLinkObject` if the operation is performed asynchronously, `None` otherwise
ru: :any:`SyncOperationLinkObject`, если операция выполняется асинхронно, иначе `None`

source: :any:`SyncResourceLinkObject` or :any:`SyncOperationLinkObject`
ru: :any:`SyncResourceLinkObject` или :any:`SyncOperationLinkObject`

source: Object, containing paths to system folders.
ru: Объект, содержащий пути к системным папкам.

source: `str`, path to the Odnoklassniki folder
ru: `str`, путь к папке Одноклассников

source: `str`, path to the Google+ folder
ru: `str`, путь к папке Google+

source: `str`, path to the Instagram folder
ru: `str`, путь к папке Instagram

source: `str`, path to the VKontakte folder
ru: `str`, путь к папке ВКонтакте

source: `str`, path to the mail attachments folder
ru: `str`, путь к папке "Почтовые вложения"

source: `str`, path to the My World folder
ru: `str`, путь к папке Моего Мира

source: `str`, path to the Downloads folder
ru: `str`, путь к папке "Загрузки"

source: `str` path to the Applications folder
ru: `str`, путь к папке "Приложения"

source: `str`, path to the Facebook folder
ru: `str`, путь к папке Facebook

source: `str`, path to the social networks folder
ru: `str`, путь к папке социальных сетей

source: `str`, path to the Messenger Files folder
ru: `str`, путь к папке "Файлы Мессенджера"

source: `str`, path to the Meeting Materials folder
ru: `str`, путь к папке "Материалы встреч"

source: `str`, path to the camera folder
ru: `str`, путь к папке фотокамеры

source: `str`, path to the screenshot folder
ru: `str`, путь к папке скриншотов

source: `str`, path to the Scans folder
ru: `str`, путь к папке "Сканы"

source: Token object.
ru: Объект токена.

source: `str`, token string
ru: `str`, строка токена

source: `str`, the refresh-token
ru: `str`, refresh-токен

source: `str`, type of the token
ru: `str`, тип токена

source: `int`, amount of time before the token expires
ru: `int`, количество времени, на которое выдаётся токен

source: `str`, list of rights requested by the application, returned only if the token has a smaller set of rights than requested
ru: `str`, список прав, запрашиваемых приложением, возвращается только если токен обладает меньшим набором прав, чем было запрошено

source: Result of token revocation request.
ru: Результат запроса по отзыву токена.

source: `list`, list of resources (:any:`TrashResourceObject`)
ru: `list`, список ресурсов (:any:`TrashResourceObject`)

source: :any:`TrashResourceListObject`, list of nested resources
ru: :any:`ResourceListObject`, список вложенных ресурсов

source: User object.
ru: Объект пользователя.

source: `str`, user's display name
ru: `str`, отображаемое имя пользователя

source: `str`, user's UID
ru: `str`, уникальный идентификатор пользователя

source: `str`, user's country
ru: `str`, страна пользователя

source: `bool`, tells whether it's a child account
ru: `bool`, признак того, что аккаунт является детским

source: `str`, user's login
ru: `str`, логин пользователя

source: Bases: :py:class:`~yadisk.objects._disk.UserObject`
ru: Базовые классы: :py:class:`~yadisk.objects._disk.UserObject`

source: Public user information object. Inherits from :any:`UserObject` for compatibility.
ru: Публичная информация о пользователе. Наследуется от :any:`UserObject` для совместимости.

source: Bases: :py:class:`object`
ru: Базовые классы: :py:class:`object`

source: Base class for all objects mirroring the ones returned by Yandex.Disk REST API. It must have a fixed number of fields, each field must have a type. It also supports subscripting and access of fields through the . operator.
ru: Базовый класс для всех объектов, реализующий объекты, возвращаемые REST API Яндекс.Диска. У наследующего объекта фиксированное количество полей, каждое со своим типом. Поддерживает доступ по индексу и через точку.

source: The :code:`@` operator. Same as :any:`YaDiskObject.field()`. Can be used like this:
ru: Оператор :code:`@`. Делает то же самое, что :any:`YaDiskObject.field()`.Может быть использован следующим образом:

source: `str`, name of the field
ru: `str`, имя поля

source: value of the given field is :code:`None`
ru: значение требуемого поля - :code:`None`

source: field's value
ru: значение поля

source: Get value of field `name`, guarantee it's not :code:`None` or raise a :any:`ValueError`.
ru: Получает значение поля `name`, гарантируя, что оно не :code:`None` или вызывает :any:`ValueError` в противном случае

source: Set all the fields of the object to the values in `source_dict`. All the other fields are ignored
ru: Задаёт значения всех полей объекта из `source_dict`. Все остальные ключи игнорируются.

source: `dict` or `None` (nothing will be done in that case)
ru: `dict` или `None` (тогда ничего не будет сделано)

source: Remove an alias.
ru: Удаляет псевдоним.

source: Remove field.
ru: Удаляет поле.

source: Set an alias.
ru: Задаёт псевдоним.

source: `str`, alias to add
ru: `str`, псевдоним

source: `str`, field name
ru: `str`, имя поля

source: Set field type.
ru: Задаёт тип поля.

source: type or factory
ru: тип данных или factory

source: Set the field types of the object
ru: Задаёт типы полей объекта

source: `dict`, where keys are the field names and values are types (or factories)
ru: `dict`, где ключи - это наименования полей, а значения - это типы

source: Session Interface
ru: Интерфейс Session

source: The :any:`Session` and :any:`AsyncSession` are abstract classes that act as adapters to underlying HTTP client libraries. A session instance is used by :any:`Client` or :any:`AsyncClient` to perform all the HTTP requests to the Yandex.Disk API.
ru: :any:`Session` и :any:`AsyncSession` - абстрактные классы, которые работают в качестве адаптеров для нижележащих HTTP библиотек. Экземпляр сессии используется в :any:`Client` или :any:`AsyncSession` для выполнения всех HTTP запросов к API Яндекс.Диска.

source: These interfaces can be implemented to add support for any HTTP library. For a concrete example, see the source code of any existing implementation (e.g. :any:`HTTPXSession`).
ru: Эти интерфейсы могут быть реализованы, чтобы добавить поддержку любой HTTP библиотеки. Для конкретного примера см. исходный код любой из существующих реализаций (например, :any:`HTTPXSession`).

source: Synchronous
ru: Синхронный

source: HTTP session class. Maintains open connections, stores headers and some other request parameters.
ru: Класс HTTP сессии. Поддерживает открытые соединения, хранит заданные заголовки и некоторые другие параметры запросов.

source: Must be explicitly closed (can be done using the `with` statement).
ru: Должен быть явным образом закрыт (может быть сделано с помощью конструкции `with`).

source: Closes the session.
ru: Закрывает сессию.

source: This is an abstract method that needs to be implemented.
ru: Это абстрактный метод, который необходимо реализовать.

source: Sends an HTTP request with given parameters. In case an error occurs, the method should throw one of exceptions derived from :any:`YaDiskError`. Additional keyword arguments may be passed, they may be forwarded to the underlying HTTP client without modification.
ru: Отправляет HTTP запрос с указанными параметрами. В случае ошибки, метод должен вызвать одно из исключений, основанных на :any:`YaDiskError`. Могут быть указаны дополнительные keyword-аргументы, они могут быть напрямую переданы в нижележащий HTTP клиент без изменений.

source: `dict`, GET parameters
ru: `dict`, GET параметры

source: `bytes`, an iterator or a file-like object, data to be sent in the request body
ru: `bytes`, итератор или файл-подобный объект, данные, которые будут отправлены в теле запроса

source: `dict`, additional headers to be set
ru: `dict`, дополнительные заголовки

source: request timeout, a `tuple` of `(read timeout, connect timeout)`, `float` or `None` (no timeout)
ru: таймаут запроса, `tuple` вида `(read timeout, connect timeout)`, `float` или `None` (без таймаута)

source: `bool`, if `False`, the response content will be immediately downloaded
ru: `bool`, если `False`, содержимое ответа будет сразу целиком скачано

source: :any:`Response`, response object
ru: :any:`Response`, объект ответа

source: Represents an HTTP response.
ru: Представляет собой ответ HTTP.

source: In case an error occurs, methods of this class should throw one of exceptions derived from :any:`YaDiskError`.
ru: В случае, если возникает ошибка, методы данного классы должны вызвать одно из исключений, основанных на :any:`YaDiskError`.

source: `int`, HTTP status code
ru: `int`, HTTP код статуса

source: Closes the response and releases the underlying connection into the pool
ru: Закрывает ответ и освобождает лежащее в основе соединение в пул

source: Downloads response's content.
ru: Скачивает содержимое ответа.

source: function, takes one parameter - chunk of data (bytes), consumes the chunk (e.g. by writing to a file)
ru: функция, принимает 1 параметр - фрагмент данных (bytes), потребляет этот фрагмент (например, записывает его в файл)

source: could not receive the response's body
ru: не удалось получить тело ответа

source: Convenience wrapper for :any:`yadisk.utils.get_exception`.
ru: Обёртка над :any:`yadisk.utils.get_exception` для удобства.

source: Returns JSON-content of the response (parses JSON).
ru: Возвращает JSON, содержащийся в ответе (парсит JSON).

source: could not parse JSON
ru: не удалось обработать JSON

source: `dict`, `list`, `str`, `int`, `float` or `None`
ru: `dict`, `list`, `str`, `int`, `float` или `None`

source: Asynchronous
ru: Асинхронный

source: `bytes`, iterator (possibly async) or a file-like object (possible async), data to be sent in the request body
ru: `bytes`, итератор (возможно асинхронный) или файл-подобный объект (возможно асинхронный), данные, которые будут отправлены в теле запроса

source: Closes the response and releases the underlying connection into the pool.
ru: Закрывает запрос и освобождает лежащее в основе соединение в пул.

source: regular or async function, takes one parameter - chunk of data (bytes), consumes the chunk (e.g. by writing to a file)
ru: обычная или асинхронная функция, принимает 1 параметр - фрагмент данных (bytes), потребляет этот фрагмент данных (например, записывает его в файл)

source: Available Session Implementations
ru: Доступные реализации сессий

source: You can choose which HTTP library will be used by :any:`Client` and :any:`AsyncClient` by specifying the :code:`session` parameter. Below you can see the list of session implementations that are shipped with the :code:`yadisk` library.
ru: Вы можете выбрать, какая HTTP библиотека будет использоваться в :any:`Client` и :any:`AsyncClient`, указав параметр :code:`session`. Ниже вы можете найти список реализаций сессий, поставляемых вместе с библиотекой.

source: Alternatively, you can make your own :any:`Session`/:any:`AsyncSession` implementation. For a concrete example, take a look at the source code of any existing implementations (e.g. :any:`HTTPXSession`).
ru: Вы также можете сделать собственную реализацию :any:`Session`/:any:`AsyncSession`. Для конкретного примера, см. исходный код любой из существующих реализаций (например, :any:`HTTPXSession`).

source: Synchronous Implementations
ru: Синхронные реализации

source: Bases: :py:class:`~yadisk._session.Session`
ru: Базовые классы: :py:class:`~yadisk._session.Session`

source: :any:`Session` implementation using the `requests`_ library.
ru: Реализация :any:`Session` с помощью библиотеки `requests`_.

source: All arguments passed in the constructor are directly forwared to :any:`requests.Session`.
ru: Все аргументы, переданные конструкторе напрямую передаются в :any:`requests.Session`.

source: underlying instance of :any:`requests.Session`
ru: лежащий в основе объект :any:`requests.Session`

source: Internally, this class creates thread-local instances of :any:`requests.Session`, since it is not currently guaranteed to be thread safe. Calling :any:`Session.close()` will close all thread-local sessions managed by this object.
ru: Внутри данный класс создаёт локальные для потоков экземпляры :any:`requests.Session`, т.к. на данный момент нет гарантии их потокобезопасности. Вызов :any:`Session.close()` закрывает все сессии, управляемые данным объектом.

source: To pass `requests`-specific arguments from :any:`Client` use :code:`requests_args` keyword argument.
ru: Для того чтобы передать специфичные для `requests` аргументы из :any:`Client` используйте keyword-аргумент :code:`requests_args`.

source: Usage example:
ru: Пример использования:

source: :any:`Session` implementation using the `httpx`_ library.
ru: Реализация :any:`Session` с помощью библиотеки `httpx`_.

source: All arguments passed in the constructor are directly forwared to `httpx.Client`_.
ru: Все аргументы, переданные конструкторе напрямую передаются в `httpx.Client`_.

source: underlying instance of `httpx.Client`_
ru: лежащий в основе объект `httpx.Client`_

source: To pass `httpx`-specific arguments from :any:`Client` use :code:`httpx_args` keyword argument.
ru: Для того чтобы передать специфичные для `httpx` аргументы из :any:`Client` используйте keyword-аргумент :code:`httpx_args`.

source: :any:`Session` implementation using the `pycurl`_ library.
ru: Реализация :any:`Session` с помощью библиотеки `pycurl`_.

source: To pass `pycurl`-specific arguments from :any:`Client` use :code:`curl_options` keyword argument.
ru: Для того чтобы передать специфичные для `pycurl` аргументы из :any:`Client` используйте keyword-аргумент :code:`curl_options`.

source: Asynchronous Implementations
ru: Асинхронные реализации

source: Bases: :py:class:`~yadisk._async_session.AsyncSession`
ru: Базовые классы: :py:class:`~yadisk._async_session.AsyncSession`

source: :any:`AsyncSession` implementation using the `aiohttp`_ library.
ru: Реализация :any:`AsyncSession` с помощью библиотеки `aiohttp`_.

source: All arguments passed in the constructor are directly forwared to :any:`aiohttp.ClientSession`.
ru: Все аргументы, переданные конструкторе напрямую передаются в :any:`aiohttp.ClientSession`.

source: underlying instance of :any:`aiohttp.ClientSession`
ru: лежащий в основе объект :any:`aiohttp.ClientSession`

source: To pass `aiohttp`-specific arguments from :any:`AsyncClient` use :code:`aiohttp_args` keyword argument.
ru: Для того чтобы передать специфичные для `aiohttp` аргументы из :any:`Client` используйте keyword-аргумент :code:`aiohttp_args`.

source: :any:`AsyncSession` implementation using the `httpx`_ library.
ru: Реализация :any:`AsyncSession` с помощью библиотеки `httpx`_.

source: All arguments passed in the constructor are directly forwared to `httpx.AsyncClient`_.
ru: Все аргументы, переданные конструкторе напрямую передаются в `httpx.AsyncClient`_.

source: underlying instance of `httpx.AsyncClient`_
ru: лежащий в основе объект `httpx.AsyncClient`_

source: To pass `httpx`-specific arguments from :any:`AsyncClient` use :code:`httpx_args` keyword argument.
ru: Для того чтобы передать специфичные для `httpx` аргументы из :any:`AsyncClient` используйте keyword-аргумент :code:`httpx_args`.

source: Importing Session Classes
ru: Импортирование классов сессий

source: You can use the following functions to import a session class by name:
ru: Вы можете использовать следующие функции, чтобы импортировать класс сессии по именsи:

source: Imports relevant session class based on provided name.
ru: Импортирует релевантный класс сессии на основе указанного имени.

source: The following sessions are available:
ru: Доступны следующие сессии:

source: `str`, session name
ru: `str`, имя сессии

source: could not import module
ru: не удалось импортировать модуль

source: unknown name
ru: неизвестное имя

source: subclass of :any:`Session`
ru: класс, наследующийся от :any:`Session`

source: Imports relevant asynchronous session class based on provided name.
ru: Импортирует релевантный класс асинхронной сессии на основе указанного имени.

source: subclass of :any:`AsyncSession`
ru: класс, наследующийся от :any:`AsyncSession`

source: Settings
ru: Настройки

source: The following settings can be accessed and changed at runtime in `yadisk.settings` module:
ru: Следующие настройки в модуле `yadisk.settings` могут быть получены и изменены:

source: Base URL for Yandex.Disk's REST API. Can be overriden for testing and other purposes
ru: Базовый URL для REST API Яндекс.Диска. Может быть переопределён для тестирования и прочих целей
