Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/changelog.po
Languages: ru

source: Disable `keep-alive` when uploading/downloading files by default
ru: `keep-alive` отключается при загрузке/скачивании файлов по умолчанию

source: Fixed an off-by-one bug in `utils.auto_retry()` (which could sometimes result in `AttributeError`)
ru: Исправлен баг (ошибка на единицу) в `utils.auto_retry()` (иногда мог вызвать `AttributeError`)

source: Retry the whole request for `upload()`, `download()` and `download_public()`
ru: Повторные попытки применяются для `upload()`, `download()` и `download_public()` целиком

source: Set `stream=True` for `download()` and `download_public()`
ru: Задано `stream=True` для `download()` и `download_public()`

source: Other minor fixes
ru: Другие мелкие исправления

source: Fixed `TokenObject` having `exprires_in` instead of `expires_in` (fixed a typo)
ru: Исправлена опечатка (`TokenObject.exprires_in` -> `TokenObject.expires_in`)

source: Fixed a `TypeError` when `WrongResourceTypeError` is raised
ru: Исправлено `TypeError` при вызове `WrongResourceTypeError`

source: `refresh_token()` no longer requires a valid or empty token.
ru: `refresh_token()` больше не требует валидный или пустой токен.

source: Fixed auto retries not working. Whoops.
ru: Исправлена неработоспособность повторных попыток.

source: Fixed passing `n_retries=0` to `upload()`, `download()` and `download_public()`
ru: Исправлено использование `n_retries=0` в `upload()`, `download()` и `download_public()`

source: `upload()`, `download()` and `download_public()` no longer return anything (see the docs)
ru: `upload()`, `download()` и `download_public()` больше не возвращают ничего (см. документацию)

source: Added `utils` module (see the docs)
ru: Добавлен модуль `utils` (см. документацию)

source: Added `RetriableYaDiskError`, `WrongResourceTypeError`, `BadGatewayError` and `GatewayTimeoutError`
ru: Добавлены `RetriableYaDiskError`, `WrongResourceTypeError`, `BadGatewayError` и `GatewayTimeoutError`

source: `listdir()` now raises `WrongResourceTypeError` instead of `NotADirectoryError`
ru: `listdir()` теперь вызывает `WrongResourceTypeError` вместо `NotADirectoryError`

source: Fixed argument handling in `upload()`, `download()` and `download_public()`. Previously, passing `n_retries` and `retry_interval` would raise an exception (`TypeError`).
ru: Исправлена обработка аргументов в `upload()`, `download()` и `download_public()`. До этого использование `n_retries` и `retry_interval` вызывало исключение (`TypeError`).

source: Better exceptions (see the docs)
ru: Усовершенствованные исключения (см. документацию)

source: Added support for `force_async` parameter
ru: Добавлена поддержка параметра `force_async`

source: Minor bug fixes
ru: Мелкие исправления багов

source: Fixed yet another `listdir()` bug
ru: Исправлен ещё один баг в `listdir()`

source: Added `install_requires` argument to `setup.py`
ru: Добавлен `install_requires` в `setup.py`

source: Return `OperationLinkObject` in some functions
ru: Некоторые функции теперь возвращают `OperationLinkObject`

source: Fixed `setup.py` to exclude tests
ru: Исправлен `setup.py`, теперь исключает тесты

source: Fixed bugs in `upload`, `download` and `listdir` functions
ru: Исправлены баги в `upload`, `download` и `listdir`

source: Set default `listdir` `limit` to `10000`
ru: Значение по-умолчанию `limit` в `listdir` установлено в `10000`

source: Added settings
ru: Добавлен модуль `settings`

source: Fixed `get_code_url` function (added missing parameters)
ru: Исправлена функция `get_code_url` (добавлены недостающие параметры)

source: Fixed a major bug in `GetTokenRequest` (added missing parameter)
ru: Исправлен серьёзный баг в `GetTokenRequest` (добавлен недостающий параметр)

source: Initial release
ru: Первый релиз
