Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/changelog.po
Languages: ru

source: Changelog
ru: История изменений

source: New features:
ru: Нововведения:

source: Added new method: :any:`Client.makedirs()` / :any:`AsyncClient.makedirs()` (see `issue #53`_)
ru: Добавлен новый метод: :any:`Client.makedirs()` и :any:`AsyncClient.makedirs()` (см. `issue #53`_)

source: Added several missing fields for :any:`DiskInfoObject`:
ru: Добавлено несколько недостающих полей :any:`DiskInfoObject`

source: Added missing field :code:`sizes` for :any:`ResourceObject` and related objects
ru: Добавлено недостающее поле :code:`sizes` для :any:`ResourceObject` и связанных с ним объектов

source: Bug fixes:
ru: Исправления:

source: :any:`Client.rename()` / :any:`AsyncClient.rename()` now raises :any:`ValueError` on attempt to rename the root directory
ru: :any:`Client.rename()` / :any:`AsyncClient.rename()` теперь вызывает :any:`ValueError` при попытке переименовать корневую папку

source: Automatic retry attempt numbers were logged off by one, now they are logged correctly
ru: Номера автоматических повторных попыток логировались с ошибкой на единицу, теперь они логируются правильно

source: Added new exception classes: :any:`GoneError` and :any:`ResourceDownloadLimitExceededError`
ru: Добавлены новые исключения: :any:`GoneError` и :any:`ResourceDownloadLimitExceededError`

source: Added a new method: :any:`Client.get_all_public_resources()` and :any:`AsyncClient.get_all_public_resources()`
ru: Добавлен новый метод: :any:`Client.get_all_public_resources()` и :any:`AsyncClient.get_all_public_resources()`

source: Fixed setting :code:`headers` and session arguments to :code:`None` causing errors
ru: Задание :code:`headers` и других опциональных параметров сессии как :code:`None` больше не вызывает ошибок

source: Fixed incorrect handling of empty filename in :any:`Client.rename()` and :any:`AsyncClient.rename()`
ru: Исправлено неправильное поведение :any:`Client.rename()` и :any:`AsyncClient.rename()` при указании пустого имени файла

source: Fixed several typos in async convenience method implementations (:code:`listdir()` and related)
ru: Исправлено несколько опечаток в асинхронных реализациях convenience-методов (:code:`listdir()` и аналогичных)

source: Fixed :any:`PublicResourceListObject` having the wrong type for its :code:`items` member
ru: Исправлен неправильный тип данных у атрибута :code:`items` класса :any:`PublicResourceListObject`

source: Fixed API requests not working with :any:`PycURLSession` when :code:`stream=True` is set
ru: Исправлены ошибки при отправке запросов API с помощью :any:`PycURLSession` при задании :code:`stream=True`

source: No data will be written to the output file by :any:`Client.download()`, :any:`Client.download_by_link()`, :any:`AsyncClient.download()` and :any:`AsyncClient.download_by_link()` if the server returns a bad status code
ru: Данные не будут записаны в файл методами :any:`Client.download()`, :any:`Client.download_by_link()`, :any:`AsyncClient.download()` и :any:`AsyncClient.download_by_link()`, если сервер вернул ошибочный код состояния

source: Fixed broken :code:`pyproject.toml` that did not include full package contents (see `issue #49`_)
ru: Исправлен сломанный :code:`pyproject.toml`, который не включал в сборку полное содержимое пакета (см. `issue #49`_)

source: Breaking changes:
ru: Несовместимые изменения:

source: See :doc:`/migration_guide` for full details
ru: См. :doc:`/migration_guide` для подробностей

source: All methods wait for asynchronous operations to complete by default (see the new :code:`wait=<bool>` parameter)
ru: Все методы теперь ожидают завершения асинхронных операций по умолчанию (см. новый параметр :code:`wait=<bool>`)

source: Iterating over the result of :any:`AsyncClient.listdir()` no longer requires the additional await keyword.
ru: Итерация по результату :any:`AsyncClient.listdir()` больше не требует дополнительного ключевого слова await

source: Number of returned items of :any:`Client.get_files()` / :any:`AsyncClient.get_files()` is now controlled by the :code:`max_items` parameter, rather than :code:`limit`
ru: Число возвращаемых файлов :any:`Client.get_files()` / :any:`AsyncClient.get_files()` теперь контролируется параметром :code:`max_items`, вместо :code:`limit`

source: Methods :code:`set_token()`, :code:`set_headers()` of :any:`Session` and :any:`AsyncSession` were removed
ru: Методы :code:`set_token()`, :code:`set_headers()` интерфейсов :any:`Session` и :any:`AsyncSession` были удалены

source: Some methods no longer accept the :code:`fields` parameter
ru: Некоторые методы больше не принимают параметр :code:`fields`

source: :any:`Client.get_last_uploaded()` / :any:`AsyncClient.get_last_uploaded()` now return a list instead of a generator
ru: :any:`Client.get_last_uploaded()` / :any:`AsyncClient.get_last_uploaded()` теперь возвращает список вместо генератора

source: :code:`yadisk.api` is now a private module
ru: :code:`yadisk.api` - теперь скрытый модуль

source: All private modules were renamed to have names that start with :code:`_` (e.g, :code:`yadisk._api`)
ru: Все скрытые модули были переименованы, их имена начинаются с :code:`_` (например, :code:`yadisk._api`)

source: Added methods to wait until an asynchronous operation completes (see :any:`Client.wait_for_operation()` / :any:`AsyncClient.wait_for_operation()`)
ru: Добавлены методы для ожидания завершения асинхронной операции (см. :any:`Client.wait_for_operation()` / :any:`AsyncClient.wait_for_operation()`)

source: Methods that may start an asynchronous operation now accept additional parameters: :python:`wait: bool = True`, :python:`poll_interval: float = 1.0` and :python:`poll_timeout: Optional[float] = None`
ru: Методы, которые могут запускать асинхронную операцию, теперь принимают дополнительные параметры: :python:`wait: bool = True`, :python:`poll_interval: float = 1.0` и :python:`poll_timeout: Optional[float] = None`

source: :any:`Client.listdir()`, :any:`Client.get_files()` and their async variants now accept a new parameter :python:`max_items: Optional[int] = None`, which can be used to limit the maximum number of returned items
ru: :any:`Client.listdir()`, :any:`Client.get_files()` и их асинхронные вариации теперь принимают новый параметр :python:`max_items: Optional[int] = None`, который может быть использован, чтобы ограничить максимальное число возвращаемых файлов

source: Most :any:`Client` and :any:`AsyncClient` methods now accept an optional parameter :python:`retry_on: Optional[Tuple[Type[Exception], ...]] = None`, which lets you specify a tuple of additional exceptions that can trigger an automatic retry
ru: Большинство методов :any:`Client` и :any:`AsyncClient` теперь принимает :python:`retry_on: Optional[Tuple[Type[Exception], ...]] = None`, который позволяет указывать кортеж из дополнительных исключений, которые могут вызвать автоматическую повторную попытку

source: :any:`yadisk.types` module is now public
ru: Модуль :any:`yadisk.types` - теперь публичный

source: Added basic logging of outgoing API requests and automatic retries
ru: Добавлено логирование исходящих запросов к API и автоматических повторных попыток

source: The logger instance for the library can be accessed as :any:`yadisk.settings.logger`
ru: Объект логгера библиотеки доступен как :any:`yadisk.settings.logger`

source: Added :any:`YaDiskObject.field()` and the :code:`@` operator (:any:`YaDiskObject.__matmul__()`) which verify that the given field is not :code:`None`
ru: Добавлен метод :any:`YaDiskObject.field()` и оператор :code:`@` (:any:`YaDiskObject.__matmul__()`), который удостоверяется, что указанное поле объекта не является :code:`None`

source: Added :any:`Client.get_upload_link_object()`, :any:`AsyncClient.get_upload_link_object()` whose return values additionally contain :code:`operation_id`
ru: Добавлены методы :any:`Client.get_upload_link_object()`, :any:`AsyncClient.get_upload_link_object()`, возвращаемые значения которых дополнительно содержат :code:`operation_id`

source: :any:`utils.auto_retry()` now accepts more parameters
ru: :any:`utils.auto_retry()` теперь принимает больше параметров

source: Added a few missing fields for :any:`DiskInfoObject`
ru: Добавлено несколько недостающих полей :any:`DiskInfoObject`

source: :any:`EXIFObject` now contains GPS coordinates
ru: :any:`EXIFObject` теперь содержит GPS-координаты

source: :any:`CaseInsensitiveDict` is now part of :any:`yadisk.utils`
ru: :any:`CaseInsensitiveDict` - теперь часть :any:`yadisk.utils`

source: Improvements:
ru: Улучшения:

source: Added full type hints for :any:`Client`, :any:`AsyncClient` through :code:`.pyi` stub files
ru: Добавлены полные подсказки типов для :any:`Client` и :any:`AsyncClient` с помощью файлов :code:`.pyi`

source: Docstrings for :any:`Client` / :any:`AsyncClient` now include more parameters
ru: Строки документации для :any:`Client` / :any:`AsyncClient` теперь включают в себя больше параметров

source: Errors during JSON processing (e.g. :any:`InvalidResponseError`) also trigger automatic retries
ru: Ошибки во время обработки JSON (например, :any:`InvalidResponseError`) также вызывают автоматические повторные попытки

source: Error message when the default session module is not available is now less confusing (see `issue #43`_)
ru: Сообщение об ошибке в случае, когда модуль сессии по умолчанию недоступен, теперь не вводит в заблуждение (см. `issue #43`_)

source: Reduced :any:`Client.listdir()`'s default :code:`limit` to :code:`500` from :code:`10000` to avoid timeouts on large directories (see `issue #45`_)
ru: Уменьшено значение :code:`limit` до :code:`500` (было :code:`10000`) для :any:`Client.listdir()` для избежания таймаутов при больших папках (см. `issue #45`_)

source: Reduced :any:`Client.get_files()`'s default :code:`limit` to :code:`200` from :code:`1000` to avoid timeouts
ru: Уменьшено значение :code:`limit` до :code:`200` (было :code:`1000`) для :any:`Client.get_files()` для избежания таймаутов

source: :any:`Client.download()` and similar methods no longer set :code:`Connection: close` header, since it's not necessary (unlike with :any:`Client.upload()`)
ru: :any:`Client.download()` и подобные методы больше не задают заголовок :code:`Connection: close` т.к. в этом нет необходимости (в отличие от :any:`Client.upload()`)

source: :any:`UnknownYaDiskError` now includes status code in the error message
ru: :any:`UnknownYaDiskError` теперь включает код статуса в сообщение об ошибке

source: Fixed :code:`httpx`- and :code:`aiohttp`-based session implementations not converting their exceptions to :any:`RequestError` in their :any:`Response.json()` / :any:`AsyncResponse.json()` implementations
ru: Исправлены реализации на основе :code:`httpx` и :code:`aiohttp`: реализации методов :any:`Response.json()` / :any:`AsyncResponse.json()` не преобразовывали свои исключения в :any:`RequestError`

source: Fixed :python:`stream=True` not being set by default in :any:`AsyncClient.download()`, :any:`AsyncClient.download_public()`
ru: Исправлено: параметр :python:`stream=True` был не задан по умолчанию в :any:`AsyncClient.download()`, :any:`AsyncClient.download_public()`

source: Other changes:
ru: Другие изменения:

source: :code:`typing_extensions` is now required for Python < 3.10
ru: :code:`typing_extensions` теперь требуется для Python < 3.10

source: Fixed a bug where POST request parameters were not encoded correctly
ru: Исправлен баг, из-за которого параметры в теле POST-запроса неправильно кодировались

source: Fixed a bug in :code:`PycURLSession.send_request()` that made it ignore passed headers
ru: Исправлен баг в :code:`PycURLSession.send_request()`, из-за которого переданные заголовки игнорировались

source: :code:`RequestsSession.close()` now closes all underlying session instances, instead of only the current thread-local one
ru: :code:`RequestsSession.close()` теперь закрывает сессию для всех потоков

source: All methods of :any:`Client` and :any:`AsyncClient` now use existing session
ru: Все методы :any:`Client` и :any:`AsyncClient` теперь используют существующую сессию

source: Removed :code:`session_factory` attribute and :code:`make_session()` method of :any:`Client` and :any:`AsyncClient`
ru: Удалены аттрибут :code:`session_factory` и метод :code:`make_session()` классов :any:`Client` и :any:`AsyncClient`

source: Session class can now be specified as a string (see :any:`Client`/:any:`AsyncClient`)
ru: Класс сессии теперь может быть указан в качестве строки (см. :any:`Client`/:any:`AsyncClient`)

source: Added :any:`Client.get_device_code()`/:any:`AsyncClient.get_device_code()` methods
ru: Добавлены методы :any:`Client.get_device_code()`/:any:`AsyncClient.get_device_code()`

source: Added :any:`Client.get_token_from_device_code()`/:any:`AsyncClient.get_token_from_device_code()` methods
ru: Добавлены методы :any:`Client.get_token_from_device_code()`/:any:`AsyncClient.get_token_from_device_code()`

source: Added missing :code:`redirect_uri` parameter for :any:`Client.get_auth_url()`/:any:`AsyncClient.get_auth_url()` and :any:`Client.get_code_url()`/:any:`AsyncClient.get_code_url()`
ru: Добавлен недостающий параметр :code:`redirect_uri` для :any:`Client.get_auth_url()`/:any:`AsyncClient.get_auth_url()` и :any:`Client.get_code_url()`/:any:`AsyncClient.get_code_url()`

source: Added support for PKCE parameters for :any:`Client.get_auth_url()`/:any:`AsyncClient.get_auth_url()`, :any:`Client.get_code_url()`/:any:`AsyncClient.get_code_url()` and :any:`Client.get_token()`/:any:`AsyncClient.get_token()`
ru: Добавлена поддержка параметров PKCE для :any:`Client.get_auth_url()`/:any:`AsyncClient.get_auth_url()`, :any:`Client.get_code_url()`/:any:`AsyncClient.get_code_url()` и :any:`Client.get_token()`/:any:`AsyncClient.get_token()`

source: Added :code:`scope` attribute for :any:`TokenObject`
ru: Добавлен аттрибут :code:`scope` для :any:`TokenObject`

source: Added new exception classes: :any:`InvalidClientError`, :any:`InvalidGrantError`, :any:`AuthorizationPendingError`, :any:`BadVerificationCodeError` and :any:`UnsupportedTokenTypeError`
ru: Добавлены новые классы исключений: :any:`InvalidClientError`, :any:`InvalidGrantError`, :any:`AuthorizationPendingError`, :any:`BadVerificationCodeError` и :any:`UnsupportedTokenTypeError`

source: The library now provides both synchronous and asynchronous APIs (see :doc:`/intro` and :doc:`/api_reference/index`)
ru: Библиотека теперь предоставляет как синхронный, так и асинхронный API (см. :doc:`/intro` и :doc:`/api_reference/index`)

source: Multiple HTTP libraries are supported by default (see :doc:`/api_reference/sessions` for the full list)
ru: Теперь поддерживается несколько HTTP библиотек (см. :doc:`/api_reference/sessions` для полного списка)

source: It is now possible to add support for any HTTP library (see :doc:`/api_reference/session_interface`)
ru: Теперь возможно добавить поддержку любой HTTP библиотеки (см. :doc:`/api_reference/session_interface`)

source: `requests`_ is now an optional dependency (although it's still used by default for synchronous API)
ru: `requests`_ - теперь опциональная зависимость (хотя всё ещё используется по умолчанию для синхронного API)

source: Note that now requests-specific arguments must be passed differently (see :doc:`/api_reference/sessions`)
ru: Обратите внимание, что аргументы, специфичные для requests теперь передаются по другому (см. :doc:`/api_reference/sessions`)

source: Preferred HTTP client libraries must be explicitly installed now (see :doc:`/intro`)
ru: Предпочитаемые HTTP библиотеки теперь должны быть установлены явным образом (см. :doc:`/intro`)

source: :any:`Client.upload()` and :any:`Client.upload_by_link()` can now accept a function that returns an iterator (or a generator) as a payload
ru: :any:`Client.upload()` и :any:`Client.upload_by_link()` теперь могут принимать функцию, возвращающую итератор (или генератор) в качестве полезной нагрузки

source: `upload()` and `download()` (and related) methods can now upload/download non-seekable file-like objects (e.g. `stdin` or `stdout` when open in binary mode), see `PR #31`_
ru: Методы `upload()` и `download()` (и связянные с ними) теперь могут загружать/скачивать файлы, не поддерживающие операцию `seek()` (например, `stdin` и `stdout`, при условии, что они открыты в режиме `"rb"` или `"wb"`), см. `PR #31`_

source: `app:/` paths now work correctly (see `issue #26`_)
ru: Пути вида `app:/` теперь работают правильно (см. `issue #26`_)

source: Fixed `issue #29`_: TypeError: 'type' object is not subscriptable
ru: Исправлено `issue #29`_: TypeError: 'type' object is not subscriptable

source: Fixed `issue #28`_: calling `download_public()` with `path` keyword argument raises `TypeError`
ru: Исправлено `issue #28`_: `TypeError` при вызове `download_public()` с параметром `path`

source: Fixed `AttributeError` raised when calling `ResourceLinkObject.public_listdir()`
ru: Исправлено `AttributeError` при вызове `ResourceLinkObject.public_listdir()`

source: Added convenience methods to `...Object` objects (e.g. see `ResourceObject`)
ru: Добавлены convenience-методы для объектов `...Object` (например, см. `ResourceObject`)

source: Added type hints
ru: Добавлены подсказки типов (type hints)

source: Improved error checking and response validation
ru: Улучшены проверки ошибок и проверка ответа

source: Added `InvalidResponseError`, `PayloadTooLargeError`, `UploadTrafficLimitExceededError`
ru: Добавлены `InvalidResponseError`, `PayloadTooLargeError`, `UploadTrafficLimitExceededError`

source: Added a few missing fields to `DiskInfoObject` and `SystemFoldersObject`
ru: Добавлено несколько недостающих полей объектов `DiskInfoObject` и `SystemFoldersObject`

source: Added `rename()`, `upload_by_link()` and `download_by_link()` methods
ru: Добавлены методы `rename()`, `upload_by_link()` и `download_by_link()`

source: Added `default_args` field for `YaDisk` object
ru: Добавлен аттрибут `default_args` объекта `YaDisk`

source: `download()` and `upload()` now return `ResourceLinkObject`
ru: `download()` и `upload()` теперь возвращают `ResourceLinkObject`

source: Returned `LinkObject` instances have been replaced by more specific subclasses
ru: До этого возвращаемые объекты `LinkObject` были заменены более конкретными подклассами

source: :any:`ConnectionError` now also triggers a retry
ru: :any:`ConnectionError` теперь тоже вызывает повторную попытку

source: Fixed incorrect behavior of the fix from 1.2.18 for paths `disk:` and `trash:` (only these two).
ru: Исправлено неправильное поведение фикса из 1.2.18 для путей `disk:` и `trash:`.

source: Fixed `issue #26`_: ':' character in filenames causes `BadRequestError`. This is due the behavior of Yandex.Disk's REST API itself but is avoided on the library level with this fix.
ru: Исправлено `issue #26`_: символ ':' в именах файлов приводит к `BadRequestError`. Это поведение вызвано работой самого REST API Яндекс.Диска, но было исправлено на уровне библиотеки.

source: Fixed a minor bug which could cause a `ReferenceError` (which would not cause a crash, but still show an error message). The bug involved using `__del__()` method in `SelfDestructingSession` to automatically close the sessions it seems to affect primarily old Python versions (such as 3.4).
ru: Исправлен баг, связанный с автоматическим закрытием сессии.Использование метода `__del__()` приводило в некоторых случаях к ошибке `ReferenceError` (ошибка игнорировалась, но сообщение выводилось).Баг проявляется по большей части в старых версиях Python (например 3.4).

source: Fixed a bug in `check_token()`: could throw `ForbiddenError` if the application lacks necessary permissions (`issue #23`_).
ru: Исправлен баг в `check_token()`: функция могла вызвать :code:`ForbiddenError`, если у приложения недостатчно прав (`issue #23`_).

source: Fixed an issue where `http://` links were not recognized as operation links (they were assumed to always be `https://`, since all the other requests are always HTTPS). Occasionally, Yandex.Disk can for some reason return an `http://` link to an asynchronous operation instead of `https://`. Both links are now recognized correctly and an `https://` version will always be used by `get_operation_status()`, regardless of which one Yandex.Disk returned.
ru: Исправлено: не распознавались ссылки на асинхронные операции, если они использовали `http://` (вместо `https://`). Иногда Яндекс.Диск может вернуть `http://` ссылку на асинхронную операцию. Теперь обе версии ссылок распознаются правильно, при этом, при получении информации об операции (через `get_operation_status()`) всегда используется `https://` версия ссылки, даже если Яндекс.Диск вернул `http://`.

source: Fixed a `TypeError` in `get_public_*` functions when passing `path` parameter (see `issue #7`_)
ru: Исправлена ошибка `TypeError` в функциях `get_public_*` при использовании с параметром `path` (`issue #7`_)

source: Added `unlimited_autoupload_enabled` attribute for `DiskInfoObject`
ru: Добавлен аттрибут `unlimited_autoupload_enabled` для `DiskInfoObject`

source: Added `md5` parameter for `remove()`
ru: Добавлен параметр `md5` для `remove()`

source: Added `UserPublicInfoObject`
ru: Добавлен `UserPublicInfoObject`

source: Added `country` attribute for `UserObject`
ru: Добавлен аттрибут `country` для `UserObject`

source: Added `photoslice_time` attribute for `ResourceObject`, `PublicResourceObject` and `TrashResourceObject`
ru: Добавлен аттрибут `photoslice_time` для `ResourceObject`, `PublicResourceObject` и `TrashResourceObject`

source: Fixed `fields` parameter not working properly in `listdir()` (`issue #4`_)
ru: Исправлен баг: не работает параметр `fields` в `listdir()` (`issue #4`_)

source: Added the missing parameter `sort` for `get_meta()`
ru: Добавлен недостающий параметр `sort` для `get_meta()`

source: Added `file` and `antivirus_status` attributes for `ResourceObject`, `PublicResourceObject` and `TrashResourceObject`
ru: Добавлены аттрибуты `file` и `antivirus_status` для `ResourceObject`, `PublicResourceObject` и `TrashResourceObject`

source: Added `headers` parameter
ru: Добавлен параметр `headers`

source: Fixed a typo in `download()` and `download_public()` (`issue #2`_)
ru: Исправлена опечатка в `download()` и `download_public()` (`issue #2`_)

source: Removed `*args` parameter everywhere
ru: Убран параметр `*args`

source: Fixed `timeout=None` behavior. `None` is supposed to mean 'no timeout' but in the older versions it was synonymous with the default timeout.
ru: Исправлено поведение `timeout=None`. `None` должен означать 'без таймаута', но в предыдущих версиях значение `None` было синонимично со стандартным таймаутом.

source: Changed the license to LGPLv3 (see `COPYING` and `COPYING.lesser`)
ru: Изменена лицензия на LGPLv3 (см. `COPYING` и `COPYING.lesser`)

source: Other package info updates
ru: Другие изменения информации о пакете

source: Fixed a couple of typos: `PublicResourceListObject.items` and `TrashResourceListObject.items` had wrong types
ru: Исправлено несколько опечаток: у `PublicResourceListObject.items` и `TrashResourceListObject.items` были неправильные типы данных

source: Substitute field aliases in `fields` parameter when performing API requests (e.g. `embedded` -> `_embedded`)
ru: Псевдонимы полей в параметре `fields` заменяются при выполнении запросов API (например, `embedded` -> `_embedded`)

source: Fixed a file rewinding bug when uploading/downloading files after a retry
ru: Исправлен баг перемотки файла при загрузке/скачивании после повторной попытки

source: Now caching `requests` sessions so that open connections can be reused (which can significantly speed things up sometimes)
ru: Теперь объекты сессий `requests` кэшируются, чтобы их можно было переиспользовать (иногда может существенно ускорить выполнение запросов)
