Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/intro.po
Languages: ru

source: Introduction
ru: Введение

source: YaDisk is a Yandex.Disk REST API client library.
ru: YaDisk - это библиотека-клиент REST API Яндекс.Диска.

source: Installation
ru: Установка

source: :code:`yadisk` supports multiple HTTP client libraries and has both synchronous and asynchronous API.
ru: :code:`yadisk` поддерживает несколько HTTP библиотек и реализует одновременно как синхронный, так и асинхронный API.

source: The following HTTP client libraries are currently supported:
ru: На данный момент поддерживаются следующие HTTP библиотеки:

source: :code:`requests` (used by default for synchronous API)
ru: :code:`requests` (используется по умолчанию для синхронного API)

source: :code:`httpx` (both synchronous and asynchronous, used by default for asynchronous API)
ru: :code:`httpx` (синхронный и асинхронный API, используется по умолчанию для асинхронного API)

source: :code:`aiohttp` (asynchronous only)
ru: :code:`aiohttp` (асинхронный API)

source: :code:`pycurl` (synchronous only)
ru: :code:`pycurl` (синхронный API)

source: For synchronous API (installs :code:`requests`):
ru: Для синхронного API (устанавливает :code:`requests`):

source: For asynchronous API (installs :code:`aiofiles` and :code:`httpx`):
ru: Для асинхронного API (устанавливает :code:`httpx` и :code:`aiofiles`):

source: Alternatively, you can manually choose which optional libraries to install:
ru: Вы можете также вручную установить нужные библиотеки:

source: Links to Official Yandex.Disk REST API Docs
ru: Ссылки на официальную документацию REST API Яндекс.Диска

source: `Official Yandex.Disk REST API Docs <https://yandex.com/dev/disk/rest/>`__
ru: `Официальная документация REST API Яндекс.Диска <https://yandex.ru/dev/disk/rest/>`__

source: `Polygon <https://yandex.com/dev/disk/poligon>`__
ru: `Полигон <https://yandex.ru/dev/disk/poligon>`__

source: Examples
ru: Примеры

source: Synchronous API
ru: Синхронный API

source: Receiving token with confirmation code
ru: Получение токена через код подтверждения

source: Recursive upload
ru: Рекурсивная загрузка файлов

source: Setting custom properties of files
ru: Задание пользовательских свойств файлов

source: Emptying the trash bin
ru: Очищение корзины

source: Specifying HTTP client library
ru: Выбор HTTP библиотеки

source: Asynchronous API
ru: Асинхронный API
