Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/known_issues.po
Languages: ru

source: Known Issues
ru: Известные проблемы

source: Very Slow Upload of Certain Types of Files
ru: Очень медленная загрузка некоторых типов файлов на Яндекс.Диск

source: The following information may become outdated at some point in the future.
ru: Данная информация может в дальнейшем будущем оказаться устаревшей.

source: Yandex.Disk's REST API limits upload speeds up to 128 KiB/s for certain MIME types of files. More specifically, throttling takes place based on value of :code:`media_type` (see :any:`yadisk.YaDisk.get_meta`). It appears there are 3 types of media types that are throttled:
ru: REST API Яндекс.Диск ограничивает скорость загрузки файлов на Диск до 128 KiB/s для определенных MIME типов файлов. Если быть точнее, троттлинг осуществляется в зависимости от значения :code:`media_type` (см. :any:`yadisk.YaDisk.get_meta`). Судя по всему ограничение скорости действует на 3 типа файлов (media type):

source: This behavior of throttling is predetermined at the moment of requesting an upload link (with :any:`yadisk.YaDisk.get_upload_link`). The content of the uploaded file does not matter.
ru: Ограничение скорости предопределяется в момент получения ссылки для загрузки файла на диск (см. :any:`yadisk.YaDisk.get_upload_link`). Содержимое загружаемого файла не имеет значения.

source: The reason why this problem cannot be observed when uploading through the official website, is that this throttling does not apply to internal services (the Yandex.Disk website uses an intermediate internal API to obtain upload links).
ru: Причина, по которой эта проблема не наблюдается при попытке загрузить файл через официальный сайт, заключается в том, что ограничение скорости не применяется для внутренних сервисов (сайт Яндекс.Диска использует промежуточный внутренний API для получения ссылок).

source: While it is not clear what the purpose of this throttling is, it is certain at this point that this is not a bug.
ru: Хотя и не понятно, в чем смысл такого ограничения, это точно не баг.

source: The only known workaround is to upload files with changed filename extensions (or without them entirely). For example, if you want to upload a file named "my_database.db", you can initially upload it under the name "my_database.some_other_extension" and then rename it back to "my_database.db". This approach has some obvious downsides but at least it works.
ru: Единственный известный способ обхода данной проблемы - это загрузка файлов с измененным расширением (или без расширения). Например, если вы хотите загрузить на Диск файл "my_database.db", вы можете изначально загрузить его под именем "my_database.some_other_extension" и после загрузки переименовать обратно в "my_database.db". У такого подхода есть очевидные недостатки, но по крайней мере он работает.

source: Low Upload Speed on Windows
ru: Низкая скорость загрузки файлов на Диск под Windows

source: If you experience low upload speeds on Windows, the reason might be due to Python's standard library internally using :code:`select()` to wait for sockets. There are several ways around it:
ru: Если вы столкнулись с низкой скоростью загрузки файлов на Диск под Windows, то причиной может стандартная библиотека Python, которая внутри использует :code:`select()` для ожидания сокетов. В таком случае существует несколько путей обхода данной проблемы:

source: Monkey-patching `http.client`_ and `urllib3`_ to use bigger :code:`blocksize`. See `this comment <https://github.com/urllib3/urllib3/issues/1394#issuecomment-954044006>`_ for more details.
ru: Monkey-patch `http.client`_ и `urllib3`_, чтобы увеличить :code:`blocksize`. См. `этот комментарий <https://github.com/urllib3/urllib3/issues/1394#issuecomment-954044006>`_.

source: Monkey-patching through a library like `eventlet`_.
ru: Monkey-patch через библиотеку `eventlet`_.

source: Using `yadisk-async`_ instead. It uses `aiohttp`_ instead of `requests`_.
ru: Использование `yadisk-async`_. Эта версия использует `aiohttp`_ вместо `requests`_.

source: Uploading files to direct links (obtained through :any:`yadisk.YaDisk.get_upload_link()`) using a different library (such as `aiohttp`_).
ru: Загрузка файлов по прямым ссылкам (полученным через :any:`yadisk.YaDisk.get_upload_link()`), используя другую библиотеку (например, `aiohttp`_).
