Repository: HelgLeshiy/yadisk_with_progress
Catalog: docs/locales/*/LC_MESSAGES/migration_guide.po
Languages: ru

source: Migration Guide
ru: Руководство по миграции

source: Migrating From 2.x to 3.x
ru: Миграция с 2.x на 3.x

source: Waiting for asynchronous operations to complete
ru: Ожидание завершения асинхронной операции

source: Starting with the version 3.0.0, the following methods will automatically wait for the asynchronous operation to complete:
ru: Начиная с версии 3.0.0, следующие методы автоматически ожидают завершения асинхронной операции:

source: This new behavior is controlled by the :code:`wait` parameter, which defaults to :code:`True`. Waiting is performed by repeatedly checking the operation status (see :any:`Client.get_operation_status()` and :any:`Client.wait_for_operation()`) and calling :any:`time.sleep` / :any:`asyncio.sleep`. If this parameter is explicitly set to :code:`False`, no additional waiting is performed, this matches the old behavior.
ru: Новое поведение контролируется параметром :code:`wait`, который по умолчанию задан как :code:`True`. Ожидание осуществляется за счёт периодической проверки статуса операции (см. :any:`Client.get_operation_status()` и :any:`Client.wait_for_operation()`) и вызова :any:`time.sleep` / :any:`asyncio.sleep`. Если этот параметр установлен в значение :code:`False`, ожидание операции не будет выполнено, это соответствует старому поведению.

source: If :code:`wait=True` is set, there is a possibility of getting an :any:`AsyncOperationFailedError`, though this is very unlikely in practice.
ru: Если :code:`wait=True`, то существует вероятность получить :any:`AsyncOperationFailedError`, хотя это маловероятно на практике.

source: For more details, see documentation for any of the above-mentioned methods.
ru: См. документацию для вышеупомянутых методов для дополнительных подробностей.

source: Iterating over AsyncClient.listdir()
ru: Итерация по AsyncClient.listdir()

source: Iterating over the result of :any:`AsyncClient.listdir()` no longer requires the additional :code:`await` keyword:
ru: Итерация по результату :any:`AsyncClient.listdir()` больше не требует дополнительного ключевого слова :code:`await`:

source: Changes with get_files()
ru: Изменения, касающиеся get_files()

source: Before the version 3.0.0, :any:`Client.get_files()` / :any:`AsyncClient.get_files()` would return up to :code:`limit` files, unless it was set to :code:`None`, in which case it would return all of them.
ru: До версии 3.0.0., :any:`Client.get_files()` / :any:`AsyncClient.get_files()` возвращал не более :code:`limit` файлов, если :code:`limit != None`, иначе метод возвращал все файлы.

source: Starting with the version 3.0.0, to control the number of returned files, a new parameter :code:`max_items` is introduced. :code:`limit` only affects the number of files queried by a single request (requests are sent until :code:`max_items` files are obtained or end of the list is reached). This new behavior is consistent with :any:`Client.listdir()` / :any:`AsyncClient.listdir()`.
ru: Начиная с версии 3.0.0, для контроля числа возвращённых файлов доступен новый параметр :code:`max_items`. :code:`limit` влияет только на количество файлов запрашиваемых одним запросом (запросы отправляются до тех пор, пока не получено :code:`max_items` файлов или достигнут конец списка). Новое поведение соответствует :any:`Client.listdir()` / :any:`AsyncClient.listdir()`.

source: get_last_uploaded() returns a list instead of a generator
ru: get_last_uploaded() возвращает список вместо генератора

source: Starting with the version 3.0.0, :any:`Client.get_last_uploaded()` / :any:`AsyncClient.get_last_uploaded()` return a list of files instead of a generator.
ru: Начиная с версии 3.0.0, :any:`Client.get_last_uploaded()` / :any:`AsyncClient.get_last_uploaded()` возвращает список файлов вместо генератора.

source: Changes with the Session interface
ru: Изменения интерфейса Session

source: In version 3.0.0, the following methods were removed:
ru: В версии 3.0.0 были удалены следующие методы:

source: Starting with the version 3.0.0, all HTTP headers (including the :code:`Authorization` header) are explicitly passed to :any:`Session.send_request()` / :any:`AsyncSession.send_request()`.
ru: Начиная с версии 3.0.0, все заголовки HTTP запросов (включая заголовок :code:`Authorization`) передаются явным образом напрямую в :any:`Session.send_request()` / :any:`AsyncSession.send_request()`.

source: Some methods no longer accept the fields parameter
ru: Некоторые методы больше не принимают параметр fields

source: Prior to version 3.0.0, the following methods used to accept the optional :code:`fields` parameter:
ru: До версии 3.0.0, следующие методы принимали опциональный параметр :code:`fields`:

source: Migrating From 1.x to 2.x
ru: Миграция с 1.x на 2.x

source: Merge with yadisk-async
ru: Слияние с yadisk-async

source: Starting with version 2.0.0, the library provides both synchronous and asynchronous APIs.
ru: Начиная с версии 2.0.0, библиотека предоставляет как синхронный, так и асинхронный интерфейсы.

source: Changes to exception handling
ru: Изменения в обработке исключений

source: Starting with version 2.0.0, all exceptions raised by :any:`Client` and :any:`AsyncClient` are derived from :any:`YaDiskError`. Exceptions from underlying dependencies (e.g. :code:`requests` or :code:`aiohttp`) are converted to :any:`RequestError`. A non-exhaustive list of possible exceptions is provided by the documentation for :any:`Client` and :any:`AsyncClient`. More details about exceptions are available in documentation for each specific API method.
ru: Начиная с версии 2.0.0, все исключения, вызванные :any:`Client` и :any:`AsyncClient` наследуются от :any:`YaDiskError`. Исключения от нижележащих зависимостей (например, :code:`requests` или :code:`aiohttp`) преобразуются в :any:`RequestError`. Частичный список возможных исключений приведён в документации для :any:`Client` и :any:`AsyncClient`. Дополнительные подробности доступны для каждого отдельного метода API.

source: requests and aiohttp are optional dependencies
ru: requests и aiohttp - теперь опциональные зависимости

source: Prior to version 2.0.0, :code:`requests` was listed as a dependency (and :code:`aiohttp` was listed as a dependency for :code:`yadisk-async`). :code:`requests` is still used by default but must be explicitly installed. As for the asynchronous API, :code:`httpx` is used by default, instead of :code:`aiohttp`. There are now multiple supported HTTP client libraries.
ru: До версии 2.0.0, :code:`requests` была указана в качестве обязательной зависимости (и :code:`aiohttp` была указана как зависимость для :code:`yadisk-async`). Библиотека :code:`requests` всё ещё используется по умолчанию, но должна быть явным образом установлена. Что касается асинхронного API, по умолчанию теперь используется :code:`httpx`, вместо :code:`aiohttp`. Поддерживается несколько библиотек HTTP.

source: See :doc:`/api_reference/sessions` for a full list of supported HTTP client libraries and :doc:`/intro` for installation instructions.
ru: См. :doc:`/api_reference/sessions` для полного списка поддерживаемых библиотек HTTP и :doc:`/intro` для инструкция по установке.
